{"pages":[{"title":"","text":"71e998dd83e418dd2a15218e887fa75c","link":"/baidu_verify_code-tliDpracF6.html"},{"title":"","text":"个人简介 分享很喜欢的老罗的一段话： “每一个生命来到世间都注定改变世界，别无选择。要么变得好一点，要么变得坏一点。你如果走进社会为了生存为了什么不要脸的理由，变成了一个恶心的成年人社会中的一员，那你就把这个世界变得恶心了一点点。如果你一生刚正不阿，如果你一生耿直，没有做任何恶心的事情，没做对别人有害的事情，一辈子拼了老命勉强把自己身边的几个人照顾好了，没有成名没有发财，没有成就伟大的事业，然后耿着脖子一生正直，到了七八十岁耿着脖子去世了。你这一生是不是没有改变世界？你还是改变世界了，你把这个世界变得美好了一点点。因为世界上又多了一个好人。“ 善恶终有报,天道好轮回。不信抬头看,苍天饶过谁。无论何时何地，我们都要保持一颗积极乐观、善良感恩的心。但行好事莫问前程，永远年轻，永远热内盈眶，永远保持正能量。💪💪💪💪💪💪冲鸭！！！！ -&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;个人信息：海洋生物爱好者 博客信息 网站采用的Icarus主题 追求尽可能的简洁，清晰，易用。 在Icarus主题之上进行了部分修改。 更新日志：–2020.09.20：icarus4.0适配–2020.01.18：icarus3.0适配–2019.11.17：增加深色主题开关–2019.10.30：去图，精简卡片–2019.10.22：改版部分显示，优化速度–2019.10.16：文章列表加上评论数显示–2019.10.13：改版评论–2019.09.25：图片、资源接入CDN免费jsDelivr、文章加入置顶–2019.09.19：开源博客代码–2019.09.19：修改布局，拉伸布局，更宽的展示–2019.09.18：修改友链ui为一行三个，并适配移动端，暗黑模式文章增加评论链接，增加留言链接–2019.09.14：增加精简next主题–2019.09.14：利用中秋节放假，重做了首页的热门推荐、加个widget最新评论框、归档页加入文章贡献概览面板 本站推荐索引 博客主题相关 github Issue 作为博客微型数据库的应用 github page网站cdn优化加速 博客源码分享 博客换肤的一种实现方式思路 博客中gitalk最新评论的获取 博客图片上传picgo工具github图传使用 安装、部分配置icarus主题中文版 技术知识点 Java并发知识点 法律法规 法律法规数据库 中华人民共和国国旗法 中华人民共和国宪法 中华人民共和国消费者权益保护法 中华人民共和国刑事诉讼法 中华人民共和国婚姻法 中华人名共和国网络安全法 中华人民共和国劳动法 其他 网易云音乐歌单分享 计划2020计划 2019.12.31 2020-GOALS 跑两三场马拉松 2019计划 2018.12.31/21:59:00-&gt;更新于2019.12.31 2019-GOALS 购买的专业书籍至少看完一遍（并发、重构、设计模式…）-&gt; 95% 额外： 追了很多剧 总结： 有优点有缺点，没坚持下来的还是太多，追了太多剧。以后多学习，多思考！ 时间轴记录","link":"/about/index.html"},{"title":"","text":"🎈🎈微笑墙🎈🎈 彭小苒 唐艺昕 李一桐 gakki 图片搜集于互联网，侵权请留言，马上处理😊。","link":"/album/index.html"},{"title":"","text":"来而不往非礼也畅所欲言，有留必应","link":"/message/index.html"},{"title":"","text":"申请友链须知 原则上只和技术类博客交换，但不包括含有和色情、暴力、政治敏感的网站。 不和剽窃、侵权、无诚信的网站交换，优先和具有原创作品的网站交换。 申请请提供：站点名称、站点链接、站点描述、logo或头像（不要设置防盗链）。 排名不分先后，刷新后重排，更新信息后请留言告知。 会定期清理很久很久不更新的、不符合要求的友链，不再另行通知。 本站不存储友链图片，如果友链图片换了无法更新。图片裂了的会替换成默认图，需要更换的请留言告知。 本站友链信息如下，申请友链前请先添加本站信息： 网站图标：https://removeif.github.io/images/avatar.jpg 网站名称 奇幻海 网站地址：https://removeif.github.io 网站简介：后端开发，技术分享 加载中，稍等几秒...","link":"/friend/index.html"},{"title":"","text":"google-site-verification: googleecc1ef655c3a68ee.html","link":"/googleecc1ef655c3a68ee.html"},{"title":"","text":"&nbsp;&nbsp;听听音乐 音乐播放器由mePlayer提供，布局参照网友博客所作，感谢作者的辛勤付出。更多音乐分享请查看歌单。 &nbsp;&nbsp;看看视频 ->点击以下条目开始播放视频,向下滑动查看更多","link":"/media/index.html"},{"title":"音乐歌单收藏","text":"温馨提示：选择喜欢的音乐双击播放，由于版权原因部分不能播放。如果喜欢歌单收藏一下，去网易云都能播放哟！","link":"/music/index.html"},{"title":"","text":"碎碎念 tips：github登录后按时间正序查看、可点赞加❤️、本插件地址..「+99次查看」 碎碎念加载中，请稍等... $.getScript(\"/js/gitalk_self.min.js\", function () { var gitalk = new Gitalk({ clientID: '46a9f3481b46ea0129d8', clientSecret: '79c7c9cb847e141757d7864453bcbf89f0655b24', id: '666666', repo: 'issue_database', owner: 'removeif', admin: \"removeif\", createIssueManually: true, distractionFreeMode: false }); gitalk.render('comment-container1'); });","link":"/self-talking/index.html"}],"posts":[{"title":"2021年水下摄影大赛获奖作品","text":"自2015年起，为传承始于英国的布莱顿水下电影节，Alex Mustard, Dan Bolt ， Peter Rowlands与他们的网站Underwaterphotographer创办了年度水下摄影大赛（UPY），恢复了几十年前英国举办的大型国际水下比赛的传统。此次摄影大赛共设有 13 个类别，包括微距、广角、行为、沉船以及海洋保护等，其中有四个类别专门针对英国水域。比赛汇集了来自全球 68 个国家和地区摄影师的 4500 多张作品。下面让我们共同欣赏来自世界各地摄影师所呈现的艺术吧。 自2015年起，为传承始于英国的布莱顿水下电影节，Alex Mustard, Dan Bolt ， Peter Rowlands与他们的网站Underwaterphotographer创办了年度水下摄影大赛（UPY），恢复了几十年前英国举办的大型国际水下比赛的传统。此次摄影大赛共设有 13 个类别，包括微距、广角、行为、沉船以及海洋保护等，其中有四个类别专门针对英国水域。比赛汇集了来自全球 68 个国家和地区摄影师的 4500 多张作品。下面让我们共同欣赏来自世界各地摄影师所呈现的艺术吧。 2021年度水下摄影奖&amp;广角组冠军（Wide Angle）Winner:’Sharks’Skylight’ Renee Capozzola(USA) 广角组亚军(runner up): ‘Gothic Chamber’ Martin Broen(USA) 季军(thrid):’Jellyfish galore’ Oleg Gaponyuk(Russain) Highly Commended 'RED DOT' Tobias Friedrich(Germany) 'Upside down' Alvaro Herrero(Spain) 微距组（Marco）冠军：‘Pontohi pigmy seahorse’(彭氏豆丁海马) Galice Hoarau(Norway) 亚军:’Larval Lionfish’(幼体狮子鱼/蓑鲉) Steven Kovacs(USA) 季军:’Dream ship’ Chien-ting hou(Taiwan) Highly Commended 'Xenia piperhorse'(Xenia类海龙) Dr Alex Tattersall(UK)ps:【海龙英文为pipefish,有一种学说认为Pipehorse是海龙（pipefish）与海马（seahore）之间的进化纽带】 'Rainbow Angel'(彩虹天使(海鞘)) Viktor Lyagushkin(Russian Federation) 'The Fastest Nudy'(海蛞蝓) Fabio Iardino(Italy) 沉船组（Wrecks）冠军:’BOWLANDER’ Tobias Friedrich(Germany) 亚军:’Reclaimed by the Ocean’ Grant Thomas (UK) 季军:’Golden Hour at the Georgios’ Renee Capozzola (USA) Highly Commended 'VERTIGO(晕头转向)' Tobias Friedrich (Germany) 'Lift off' Grant Thomas (UK) 行为组（Behaviour）冠军:’A striped marlin in a high speed hunt in Mexico’ Karim Iliya (USA) 亚军:’Face to face’ JingGong Zhang (China) 季军: ‘Milk feeding’ Mike Korostelev (Russian Federation) Highly Commended 'The Last Waltz' Ralph Pace (USA) 'Orcas predating a thresher shark' Rafael Fernandez Caballero (捷克共和国) 'Embrace' João Rodrigues (Portugal) 'The next generation' Tammy Gibbs (Australia) 肖像组（Portrait）冠军:’Guardian Deity’ Ryohei Ito (Japan) 亚军:’Japanese manefish(日本鲷鱼)’ Keigo Kawamura (Japan) 季军:’French Angel’ Michael Gallagher (UK) Highly Commended 'Eye contact with humpback whale' Mike Korostelev (Russian Federation) 'Critically endangered cuban crocodile in a cenote' Anita Kainrath (Austria) 'Snooty the lemon shark' Galice Hoarau (Norway) 卡片机组（Compact）冠军:’Doule (Kuhlia Rupestris) near the surface’ Jack BERTHOMIER (New Caledonia) 亚军:’Rainbow Goby’ ManBd (Malaysia) 季军: ‘Pelagic stingray (Pteroplatytrygon violacea)’ Isaías Cruz (Spain) Highly Commended 'Toad tadpole on water lily leaf' Andrea Falcomatà (Italy) 'Life drop' Chiara Scrigner (Italy) 'The Orchid' ManBd (Malaysia) 英国水域广角组(British Waters Wide Angle)冠军:’While You Sleep’ Mark Kirkland (UK) 亚军:’The Great Migration’ Mark Kirkland (UK) 季军:’Grey seal gully’ Kirsty Andrews (UK) Highly Commended 'The gannet and the mackerel Richard Shucksmith (UK) 本文内容精选于UPY 官网，如果感兴趣的话，朋友们可以点进去欣赏更多作品。","link":"/posts/9b6854e5.html"},{"title":"Art Works for Marine","text":"住在海边，可惜一直没有机会一探海中的风情，只能依靠想象简单画出了两幅图Live in the seaside, regrettably did not have the opportunity to explore the amorous feelings in the sea all the time,can only rely on imagination to draw two pictures simply.软件：Krita","link":"/posts/82df373d.html"},{"title":"你知道鱼类也有雌雄同体吗?","text":"Translations for the following languages are also provided:English 前言鱼类雌雄同体以及鱼类变性的研究是一个很少有人专注的主题，目前的研究结果很有可能得到修改或者更正，也希望学者们能在这个领域得到突破。 在硬骨鱼纲中，个体性别的改变是非常常见的。许多的鱼类虽是雌雄异体，并且有成对的生殖腺。也就是说他们要么只有一对卵巢，或是一对精巢。 但是由于多数鱼类体外受精的繁殖方式，使得他们可以改变自己的性别，即两性二态性。鱼类会分泌激素，将未发育的腺体发育成卵巢或者是精巢。红鲷鱼就是一个很好的例子，一个红鲷鱼群由1条雄鱼和几十条雌鱼构成。雄性红雕鱼处于领导位置，带领种群觅食，保护种族安全以及交配。一旦雄鱼死亡，剩下的红雕鱼雌性中最大的个体就会发育成雄性，继续带领族群。而这一过程叫做变性。 雌雄同体不过在对过去的三千多种鱼类样本进行研究后，可以肯定的是，所有被作为样本的鱼类都是单性的–他们虽然会变性，但是不会出现雌雄同体的现象。但是在伍兹霍尔实验室的研究中，偶然发现了例外：在克鲤鱼属的條帶底鱂中，可能发现了雌雄同体的现象。在讨论具体的细节前，请大家先了解一下鱼类两性之间拥有的的第二性征。虽然不同种的鱼类区别性别的元素也有所不同但主要有以下几个方向：体型：不同的鱼类有不同的情况，一般在成熟的个体中，有些种群的雄性较大，比如上文提到的红雕鱼。也有些是雌性比雄性大，比如條帶底鱂。花纹，颜色通常来说，鱼类雌雄个体之前的花纹，或者颜色都有区别，雄性红雕鱼的颜色就比雌性更加鲜艳。 而在條帶底鱂中，两种性别的身体颜色模式完全不同;雄鱼由明显的横带组成，从头部后部一直延伸到尾鳍基部附近;另一方面，雌性的身体则主要由明显的纵向条纹组成，前部完美，后部与雄性的交叉条纹相融合。PS：交叉条纹模式是该物种的原始模式，所有的未成熟的鱼，无论性别，出生时都是这种图案。行为：在产卵季节，條帶底鱂雄性的行为与雌性形成了鲜明的对比。前者精神抖擞，好斗，经常跟在雌性后面，以便与它们产卵。 特例的发现1907年 6月3日，伍兹霍尔海洋研究所的研究者选取了一条大型的雄性條帶底鱂进行有关雄性精液的检测，可是研究者在该个体中挤出了卵子。可问题是，这只个体拥有明显的雄性特征(拥有清楚的雄性条纹)，但是有产卵雌鱼的外输卵管，背鳍的颜色并不深。这只个体被单独地养在特殊的水箱中，研究显示，这只雄性條帶底鱂的卵子有较低的生育能力。此时，另一只体型相近的雌性條帶底鱂也被放入了水箱。可能是因为所有的卵子都被排出，这条條帶底鱂变得消瘦。此外性格显得专横，并开始显现出更明显的雄性特征。 在7月的最后一个星期里，人们对这条鱼进行了密切观察。在一些场合，它表现出一种明显的男性行为。它绕着雌鱼转，反复做出动作，似乎是在微弱地试图产卵。在这一点上不能肯定，但在其他方面，这是一个求爱的雄性行为。在7月的最后一天，实验者被迫离开实验室，條帶底鱂被杀死，用福尔马林小心地保存起来。对福尔马林中保存的性腺进行检查，发现它是一个复合腺，包含约5%的睾丸组织，稍不成熟，并嵌在一团未成熟和陈旧的卵巢组织中。睾丸组织以微小肿块的形式出现，主要在腺的后端附近。虽然明显的睾丸结构，这些小肿块显示不典型的结构比正常睾丸，不紧密，并点缀结缔组织。整个腺体的颜色、大小和外观与保存完好的睾丸一样，不像产卵结束后的正常卵巢那样呈现黄色的季节。图为该雌雄同体條帶底鱂的描画。 结论1.这个讨论有趣的一点是，因为ta的组织似乎没有显示出性别的二型性，睾丸组织位于卵巢组织的后面，并在某种程度上与后者重叠。性腺的这种状况让人想起前面提到的复合腺。2. 增加了分泌物对第二性征的了解：在这种情况下，相对少量的不完善的睾丸组织的存在对个体(主要是雌性)产生了负面影响，抑制了幼鱼向雌性颜色模式的转变;这种个体在产卵季节结束时，产生的积极影响是，近似于雄性的颜色和行为。3.在现有文献中描述的系列雌雄同体的所有病例中，雌雄同体是在连续的季节发生的。在不到一个月的时间内发生了明显的原雌性变化。这种情况显然是反常的。 **Citation On a Hermaphrodite Example of the Herring(Clupa Harengus). Ann, Mag. Nat.Hist.(7), Vol.9, pp 195-196 Newman, H. H. “A Significant Case of Hermaphroditism in Fish.” Biological Bulletin, vol. 15, no. 5, Marine Biological Laboratory, 1908, pp. 207–14.","link":"/posts/bfdb824e.html"},{"title":"Welcome To Fantacy Sea","text":"这是一个关于海洋知识的博客，我会为大家展示奇妙的海中世界。欢迎大家关注&gt;_&lt;","link":"/posts/c77b8e29.html"},{"title":"关于我的微信公众号","text":"Translations for the following languages are also provided:English 各位看官大家好啊，我是奇幻海部落格的作者。 在此我想跟大家聊聊我开创这个部落格的初心与对未来的打算。2015年的夏季，奇幻海微信公众号的第一期内容正式发布，标题为从海底探寻生命之源之谜。尽管从现在来看，当时所写的内容可以用拙劣来形容，那第一次的意义依然镌刻在我的心中。从那以后，奇幻海以周更的节奏向前走了4年，从未有过间断，欣喜于哪怕只是一次阅读量破千，困惑于题材以及时间的泥淖。至2019年第229期画上短暂的句号。我目前只是一个普普通通的海洋生物爱好者，当初创立奇幻海是为了督促自己在海中的梦想里孜孜不息，深挖下去。人们都说，最高境界的学习方式是为教导别人，而我尝试以科普的形式，收获知识的同时为更多人引荐碧蓝色下的奥秘。直到我偶得机会出国深造，在面对更多的信息来源时我开始反思，作为一名科普者，如果不能保证所科普信息的真实性，准确性，以及合理性，看到吸引眼球的新闻就照搬不误，坦白了说，就是不负责任。科学文章所讲究的就是科学二字，如果内容上故意夸大，甚至是虚构伪造，那就有违宗旨。我之前所编写的那二百二十九期文章，内容上是否能保证信息的精确，又有如何的渠道来收集信息，筛选，判断，这都是一直苦恼我的问题。有时候，判断文献的准确性需要依靠大量的知识储备，理性的逻辑判断，而这些能力是5年前的我有所欠缺的。正因为我热爱海洋，所以我会对我的行为负责。在这段时间的积攒下，奇幻海以新的面孔与大家见面，希望这个小小的网站，能再发新芽。","link":"/posts/768b897d.html"},{"title":"Did you know that fish has hermaphrodites?","text":"本文同时提供以下语言的翻译:中文 IntroductionThe research on fish hermaphroditism and fish degeneration is a topic that few people pay attention to. The current research results are likely to be modified or corrected,and we hope that scholars can make breakthroughs in this field. In the class teleost, sex change is very common.Many fish are androgynous and have pairs of gonads.That is to say,They either have only one pair of ovaries or one pair of testicles.But the way most fish reproduce through ivf allows them to change their sex, known as bisexual dimorphism.Fish secrete hormones that turn undeveloped glands into ovaries, or testes.A good example is the red snapper, a school of one male and dozens of females.The male is in the lead, leading the pack in feeding, protecting the species and mating.Once the males die, the largest of the remaining females develop into males and continue to lead the pack.This process is called denaturation. HermaphroditismBut studies of more than 3,000 fish samples in the past have confirmed that all of them are unisexual – they change sex, but do not become hermaphrodites.But in the Woods Hole lab study, an exception was discovered: a possible hermaphroditism was found in striped kilopas, members of the Carp family.Before we get into the details, let’s take a look at some of the secondary sexual characteristics that fish have between the sexes.Although different species of fish have different elements to distinguish sex, there are mainly the following directions:bodily form：Different fish have different conditions,Among mature individuals, some species have larger males, such as the red eaglefish mentioned above.In some cases, the female is larger than the male, such as the striped killifish.Pattern, color:Generally speaking, males and females have different patterns, or colors, and males are more brightly colored than females. In the striped killifish, the two sexes had completely different body color patterns;Males consist of distinct transverse bands that extend from the back of the head to near the base of the caudal fin;The female’s body, on the other hand, consists mainly of distinct longitudinal stripes, perfect at the front and fused with the male’s cross stripes at the back.PS: The cross stripe pattern is the original pattern of the species, and all immature fish, regardless of sex, are born with this pattern.Behavior:During the spawning season, the behavior of the striped killifish male is in sharp contrast to that of the female.The former are energetic and aggressive and often follow females in order to lay eggs with them. The discovery of a special caseOn June 3, 1907, researchers at Woods Hole Oceanographic Institution took a large male swish for sperm testing, but they extruded eggs from the individual.The problem is that this individual has clearly male characteristics (clear male stripes), but the outer fallopian tubes of the spawning female, and the dorsal fin is not dark.The individual was kept alone in a special tank, and studies showed that the eggs of the male striped killifish had low fertility.At this point, another female of similar size was placed in the tank.Probably because all the eggs had been expelled, the killifish became emaciated.He also appeared bossy and began to take on more masculine features. The fish was closely watched during the last week of July.On some occasions, it exhibits a distinctly masculine behavior.It circles the female, making repeated movements that appear to be a faint attempt to lay eggs.Can’t be sure at this point, but in other ways, it’s a courtship male behavior.On the last day of July, the experimenters were forced to leave the lab, and the killifish was killed and carefully preserved in formalin.Examination of the gonads preserved in formalin revealed that it was a compound gland, containing about 5% of testicular tissue, slightly immature and embedded in a mass of immature and obsolete ovarian tissue.Testicular tissue appears as a tiny mass, mainly near the posterior end of the gland.Although testicular structure is evident, these small masses show atypical structure than normal testis, are less dense, and are interspersed with connective tissue.The color, size, and appearance of the entire gland are the same as that of a well-preserved testis, unlike the yellow seasons of a normal ovary after spawning.The picture shows a drawing of the Hermaphrodite striped killifish Conclusion An interesting aspect of this discussion is that because the ta tissue does not appear to show sexual dimorphism, the testicular tissue is located behind the ovarian tissue and to some extent overlapses with the latter.This condition of the gonads is reminiscent of the compound glands mentioned earlier. Increased understanding of secondary sexual characteristics of secretions: in this case, the presence of relatively small amounts of imperfect testicular tissue has a negative effect on individuals (mainly females), inhibiting the transition of juveniles to female color patterns;The positive effect of this individual at the end of the spawning season is to approximate the colour and behaviour of the male. In all cases of the series of hermaphroditism described in the available literature, hermaphroditism occurred during successive seasons.In less than a month the proto-female changes were evident.This situation is clearly anomalous.**Citation On a Hermaphrodite Example of the Herring(Clupa Harengus). Ann, Mag. Nat.Hist.(7), Vol.9, pp 195-196 Newman, H. H. “A Significant Case of Hermaphroditism in Fish.” Biological Bulletin, vol. 15, no. 5, Marine Biological Laboratory, 1908, pp. 207–14.","link":"/posts/8d37292e.html"},{"title":"如何区分章鱼，鱿鱼和乌贼？","text":"测试","link":"/posts/10dd8abd.html"},{"title":"水族馆的水质是如何保持的？如何为你的鱼儿制作一个生态缸？","text":"Translations for the following languages are also provided:English 各位养过鱼的看官是否每隔一段时间就因为水体过于浑浊而被迫换水？而有的水箱以及水族馆却能保持水质并长时间不用换水？–一个完善的水箱系统，小到家里的鱼缸，大到水族馆的大型水箱都是一个个生态的模型，同时也展示了对生命的尊重以及教育的意义。 前言想象一下，一个8000立方米储水量的巨型水箱里饲养着500多种生物，包括鲨鱼，鳐鱼，鳗鱼。。无论这些动物是游动的，底栖的，还是浮游的，他们都会排泄，此外还有喂食时的残渣。这些废料会被细菌分解为亚硝酸盐，此外藻类会暴长。高浓度的亚硝酸盐会在鱼类的鳃上留下疤痕，降低鱼类的免疫力。在这种情况下，动物可能不会表现出生病的表面症状。但它会慢慢死去，或变得更容易受到无法对抗的疾病的影响。 在水族馆，潜水员每天会都要清洗鱼缸玻璃，或者对人造珊瑚进行电动清洗，使用专门的护垫和漂白设备来清除藻类，并在狭窄的缝隙中收集废物。同时，水族馆也有强大的过滤系统：在进入水箱之前，水要经过一个三层过滤系统：包括了蛋白质过滤器，生物过滤器。他们有自己的一套‘生命支持系统’生命支持元素包括过滤、温度、光线和处理系统，这些系统用于保护整个水族馆的水质。这些系统被捆绑在一个中央计算机网络中，能够对不同的展品做出一些调整。大多数情况下，当水质在酸度、盐度或毒性方面失去平衡时，这些系统就会显示出来。生命维持系统的参数确实告诉可以告诉工作人员系统是如何运行的，但它的有效性是由水质来衡量的。所以水族馆经常需要进行水质检测。这些测试测量pH值或氨水平等因素，以便工作人员在必要时对水族馆的生物、化学和机械过滤系统进行调整。 生态缸的概念理论水族馆拥有足够的技术以及设备来维持水质，那么在家里呢？在家里的水箱如何在不换水的情况下也能保持水质？答案就在前文中提过的生物过滤器。大家可以换个角度思考，自然中的河流，湖泊又是怎么能保持水质的？–没错，就是生物过滤系统。而其中的核心就是硝化细菌（微生物代谢）。 特拉华大学海洋学院曾做过用水族馆（水箱）系统模拟海洋中营养物质的再生的实验，论文指出：生物养分再生是海洋生物生产力的主要速率控制过程。（然而，在海洋环境中直接测量再生几乎是不可能的。）限制植物生长的营养物质通过初级生产者，通过食物链，从无机形式循环到有机形式，最后通过细菌分解者循环回到无机形式。 实验表明了生物过滤系统有效地氧化了大量输入的有机物。（溶解有机碳、氮和磷含量没有增加，铵态氮和亚硝酸盐含量没有增加）家里的鱼缸虽小，但也有易操作的优势。制作一个生态缸并没有想象的那么难：现代的观赏鱼缸过滤应是同时具有机械过滤和生物过滤，两种过滤系统是相辅相成的，缺一不可，这也是水族箱局限性决定的。一旦建立完整的生态系统，有害物质可以得到分解，使毒素就大大减少，这样也可以延长水族箱的换水时间。所谓生态鱼缸就是已经建立起完全生物过滤系统，生物过滤系统便是成功在水箱中培养的的硝化细菌，通过水循环将水中的有害物质分解或过滤，在某种程度上说这种微循环系统是仿了自然界的生态系统，只不过把空间局限化了而已，本质是一样的。 操作具体的操作大家可以自行在网上搜索建立生态缸的教程,详细步骤在这里贴上一篇教程，如有侵权请联系删除。 一、开缸前的准备： 设备：水族箱（废话）、外滤桶（其它能容纳玻璃环的过滤器也可以）、打氧泵（包括软管及沙头等）、底砂（可以取消）。 药剂：喜瑞去铵及亚硝酸离子液（简称硝化细菌）。 闯缸鱼：廉价的健康的清洁工作鱼、饲料鱼等。 外滤桶的滤材设置（按水流方向）： 1、粗滤棉（两层），主要作用是进行物理预过滤，如果包在外滤桶的进水口外，则更便于更换； 2、生化棉，主要作用是培养分解有机物的消化细菌，能提高水质澄清度； 3、玻璃环，一般情况下，玻璃环体积要占全缸水体积的3～5%，主要作用是培养硝化细菌，以保证水质无毒性； 4、粗滤棉（一层），主要作用是物理过滤，打散、吸附细菌的代谢废物。 其它种类的过滤设备可参照上述外滤桶进行设置。 二、开缸过程： 第一天，安装设备——注水——铺砂（5cm左右厚度，或不铺砂）——运转设备——检查是否有漏水之处，以及设备安装是否有问题。 第二天，排水再重新注水（经过曝气处理后的自来水即可）——运转设备（过滤及打氧设备，从此不再关闭）————加入状态健康、体质健壮的闯缸鱼，按说明加入硝化细菌。（其后连续十天，按说明继续补充硝化细菌） 第七天左右，据了解一些高手开缸的经验，此时分解NH3/NH4的亚硝酸菌已经初步建立，但硝酸菌还未能跟上步伐，此时水体内NO2的含量会出现峰值，闯缸鱼容易出现不适。如果此时闯缸鱼无任何异常，进食活跃，则可在第十天起逐日继续增加闯缸鱼的数量，并逐渐增加投喂量。 一个月后，生化系统就基本稳定下来了，可以考虑加入贵价主力鱼了。 三、日常维护： 定时换水（每周换三分之一到五分之一），换水周期可逐渐加长，换水量可逐渐减少，以不出现褐藻为限。换入的水如果是自来水，要经过24小时的打气，以去除自来水中的余氯，减少对硝化系统及鱼的伤害。 定量定时喂食，不要让鱼吃得过饱，不要留残饵。 四、注意事项： a、加入闯缸鱼后，如果出现异常，则尽快换水（部分换水）。 b、过滤及打氧设备尽量不要中断运转。 c、过滤桶中的玻璃环总体积要达到全缸水体积的3～5%； d、水体含氧量与生物过滤效率相关，在不影响观赏的前提下，可增加打氧。 e、硝化细菌建议选择进口名牌的，国产杂牌的不如不用。 f、过滤系统的物理过滤及生物过滤，仅能保证水质的清澈及无毒性。对于具体鱼种而言，水温、PH值、硬度都是影响的重要因素。建议参考具体资料，对此进行相应调整。 一点个人的拙见就像我在开头说的，一个完整的水箱系统展示了一整个生态的模型。这一点在水族馆，爬行馆，乃至动物园里都尤为重要，此时教育的意义处在首要位置：展示一种生物，不是单单给你看看生物的样貌就结束了，动物在自然中的行为才是各个博物馆需要为大众普及的，而这些行为：包括栖息，捕食，乃至社交行为等都需要一个至少合格的环境来支持，更不用说一个正确生态环境本来的教育意义了。现在网络如此的普及，个人的玩家只需要动动手指便能了解你想养的动物的生态环境。为您的宠物搭建一个合理的生态环境不仅是一种尊重的态度，也能保证其生存的质量。在搭建一个精美的生态缸后，相信你能体会到更多的成就感。也许一个好的环境能使你的宠物为你带来意想不到的惊喜。 ReferenceSharp, Jonathan H., et al. “Modeling Nutrient Regeneration in the Ocean with an Aquarium System.” Marine Ecology Progress Series, vol. 8, no. 1, Inter-Research Science Center, 1982, pp. 15–23, Retrieved September 20, 2021. Citiation1.Rock, Edward A. “Aquarium Awareness.” Science and Children, vol. 27, no. 7, Temporary Publisher, 1990, pp. 4–6, Retrieved September 20, 2021.2.SCHULTZ, BETH. “THE BALANCED AQUARIUM.” Elementary School Science Bulletin, no. 69, Temporary Publisher, 1962, pp. 5–6, Retrieved September 20, 2021.3.Bell, J. (2015, December 17). Science, elbow Grease keep National AQUARIUM POOP-FREE. The Daily Times. Retrieved September 20, 2021.4.建立生态缸的详细步骤. 建立生态缸的详细步骤_水景堂. (n.d.). Retrieved September 20, 2021, from http://www.ssjjtt.com/a/2015/33267.html.","link":"/posts/e02b0abe.html"},{"title":"生物分类的概念与生物分类法","text":"Translations for the following languages are also provided:English 前段时间介绍了鳄目下三个科成员的特点，以及区分它们的方法。而这其中最基础，也是最重要的参照就是生物分类法了。生物分类法是用生物分类学方法来对生物的物种分组和归类的方法。而大家耳熟能详的域、界、门、纲、目、科、属、种便是以级别为基础的系统层次结构中使用的数量层次。在此，希望给大家介绍一下生物分类的基本概念以及历史。 什么是生物分类学生物分类学是关于生物个体的鉴定（identification）、归类（classification）和命名（nomenclature）的原理和方法的学科；而生物分类学的范围包括: 研究生物类群间的异同程度，阐明生物间的亲缘关系、演化过程和发展规律。 分类的根据说了这么多，可能大家最好奇的就是我们根据什么来将世界上这么多的物种一一分类的。–生物分类主要根据生物的形态结构,生理功能。同时，也可根据栖息环境和地理位置来做参考。举个根据形态结构分类的例子：比如说从解剖学来看，人,猴,羊.狗都有分节的脊椎，因此都归于脊椎动物亚门。相比之下有些动物背部只有一根不分节的骨,比如说文昌鱼类(头索动物亚门)，而这些背后有骨头的物种就都被分为脊索动物门。再举例：海带不再被分类为植物了，因为人们发现海带的叶绿体有四层膜，而植物的叶绿体是两层膜。可以得知海带的“祖先”应该是一种叶绿体是四层膜的生物，和我们所认为的植物是有距离的。 分类数量层次的概念种（物种）是生物分类系统上的基本单位，具有共同基因组成（由此具有共同的祖先，相似的外形、内部结构、行为等），有相对稳定的明显界限与别的物种相区别。近缘的种归合为属，近缘的属归合为科，科隶于目，目隶于纲，纲隶于门，门隶于界。具有相同或相似形态结构的生物亲缘关系近一些，同一物种的生物可以在自然状态下进行交配并且生育出可育的后代。 生物分类的历史以及意义对生物进行分类的意义是便于弄清不同类群之间的亲缘关系和进化关系。最早已知的对生命形式的分类系统由希腊哲学家亚里士多德所建立。他将动物根据运动方式（空中，陆上或水中）分类。在中国，明代李时珍（约1518–1593）在药典《本草纲目》中，将生物药材分为草部、谷部、菜部、果部、木部、虫部、鳞部、介部、禽部、兽部和人部。瑞士教授康拉德·格斯纳（Conrad Gesner, 1516–1565）将当时已知的生物进行了分析性的归纳。新大陆的发现为欧洲带来了很多新奇的动物种类的描述和标本。在16世纪晚期和17世纪早期，人们开始对动物进行了详细描述，先是人们熟悉的种类，随后逐渐扩展，直到形成了基于解剖学基础的足够大的知识体系。这些解剖学知识主要来源于医学解剖学家，随后昆虫学家和最初的显微镜学者将分类的范围进一步扩大。 现代生物分类学之父卡尔·林奈的巨著《自然系统》在其一生中被改编过12次。在此书中，自然界被划分为三个界：矿物、植物和动物。林奈用了四个分类等级：纲、目、属和种。林奈还建立了用于命名所有物种的学名的方法，并沿用至今。在林奈之前，命名一个物种需要很长的包括许多单词的名称，其中包括了对物种的描述，并且这些名称不固定。林奈将物种名称统一成两个单词的拉丁文名称，即学名，由此分开了命名法和分类法。这种生物命名的方法称作双名法。而后的生物学家才根据其用域(Domain)、界(Kingdom)、门(Phylum)、纲(Class)、目(Order)、科(Family)、属(Genus)、种(Species)加以分类。 以上就是本文的全部内容了，最后附上生物分类级别与生物分类总表的链接 Reference1.中国大百科智慧藏：分类学2. Linnaeus, Carolus. Systema naturae per regna tria naturae :secundum classes, ordines, genera, species, cum characteribus, differentiis, synonymis, locis 10th. Stockholm: Laurentius Salvius. 17583. Linnaeus, C. Systemae Naturae, sive regna tria naturae, systematics proposita per classes, ordines, genera &amp; species. 1735.4. Wikipedia,Taxonomy (biology),8,22,20215. Zhihu,2021,8,22","link":"/posts/da406dc9.html"},{"title":"生物解剖学,带你解剖小白鼠","text":"Translations for the following languages are also provided:English 前言解剖学(Anatomy)的历史最早可以追溯到古希腊时期。 这是生物学的一门分支学科，涉及生命体的结构与组织的研究。于此同时，解剖学和胚胎学，进化生物学以及系统发育有密切关系。而随着科技的发展，解剖学从单单的肉眼观察，发展并完善到了依靠各种工具和科技的配合(如显微镜,x射线,核磁共振成像等技术)。至此，解剖学可以分为微观尺度及巨观尺度。解剖学囊括了人类解剖学，动物解剖学，以及植物解剖学。本文中，将会着重于动物解剖学的介绍。 定义解剖学是对生物体结构的科学研究，包括它们的系统、器官和组织。它包括各个部件的外观和位置，组成它们的材料，它们的位置以及它们与其他部件的关系。解剖学与生理学和生物化学截然不同，后者分别处理这些部分的功能和所涉及的化学过程。例如，解剖学家关心一个器官(如肝脏)的形状、大小、位置、结构、血液供应和神经支配;生理学家对胆汁的产生、肝脏在营养中的作用和身体功能的调节感兴趣。 *在了解动物解剖学之前大部分动物的身体可以分为不同的组织，这些动物称为真后生动物。这些动物的体内有消化腔、有一个或二个开口(口，肛门)动物组织一般可以分为结缔组织、上皮组织、肌肉及神经组织。 **结缔组织:**结缔组织是纤维性的，由分散在称为细胞外基质的无机物中的细胞组成。结缔组织使器官成形并固定在适当的位置。主要类型有疏松结缔组织、脂肪组织、纤维结缔组织、软骨和骨。其中最主要的成分是胶原蛋白。 图为显微镜下的透明软骨 **上皮组织:**上皮组织由紧密包裹的细胞组成，细胞间几乎没有空隙。上皮细胞可呈鳞状、立方状或柱状，紧邻结缔组织；有许多不同类型的上皮细胞，经过修饰以适应特定的功能。比如在呼吸道中有一种纤毛上皮组织;小肠内壁有微绒毛，大肠内有肠绒毛。皮肤由覆盖在脊椎动物身体外部的角质化的分层鳞状上皮组织组成。 **肌肉:**肌肉细胞通过收缩组织掌管身体的活动。肌肉组织的功能是产生力量并引起运动，无论是广义上的运动还是内部器官的运动。肌肉由可收缩的细丝组成，分为三种主要类型;平滑肌、骨骼肌和心肌。 **神经组织:**神经组织是由许多被称为神经元的神经细胞组成的，它们相互传递信息。在简单的动物中(如腔肠动物)，体壁的受体神经元对刺激产生局部反应。在更复杂的动物中，它们拥有专门的感受器细胞，如化学感受器和光感受器，会成群结队地出现，并沿着神经网络向生物体的其他部分发送信息。神经节内的神经元可以连接在一起.在高等动物中，专门的受体是感觉器官的基础，有中枢神经系统(大脑和脊髓)和外周神经系统。 细分在动物解剖学，我们首先将有无脊椎作为为一个大的分类。还记得上一篇的分类学吗？无脊椎动物由大量的生物组成，从最简单的单细胞真核生物，如草履虫，到复杂的多细胞动物，如章鱼、龙虾和蜻蜓。它们构成了大约95%的动物物种。根据定义，这些生物都没有脊椎。再细分，如节肢动物解剖学，软体动物解剖等. 而所有的脊椎动物都有相似的基本身体结构，在它们生命中的某个时刻，主要是在胚胎阶段，有共同的主要脊索动物特征;一根坚硬的脊索;神经物质的背中空管，即神经管;咽弓;还有一条尾巴在肛门后面。脊椎动物的四肢被认为是同源的，因为相同的骨骼结构是从它们最后的共同祖先继承来的。顺便一提，在往下细分，又可以分成：对鱼类的解剖，两栖纲的解剖，爬行纲的解剖，鸟(纲)的解剖，哺乳(纲)的解剖，以及人体解剖学。（注：这里将人体解剖学区分于哺乳纲解剖之外）如此细分下来，我们就能够根据各个类别动物的特点，根据生理结构以及各其大系统的分布来进行更精确且有效率的解剖了。同时，根据解剖的结果，我们也能从中得知各类动物的差异。 解剖大鼠（注：下文内容含尸体，内脏，等图片，可能引起不适。请各位观众酌情观看，15岁以下的读者请就此止步。）最后，我将为大家介绍一场对大鼠的解剖实验，从下文的介绍中，希望大家能对解剖学的目的有些许自己的认知。原文大意：对大鼠进行解剖，探讨基本哺乳动物的内部结构和功能解剖学。本实验的目的是探索大鼠的消化道并进行观察消化系统的不同部分。通过观察大鼠消化系统的长度，可以确定他们的饮食模式的信息，并进行在老鼠和其他哺乳动物之间进行比较，如杂食动物、食肉动物和食草动物。因为老鼠是一种胎盘哺乳动物和杂食动物，它的身体结构和人类非常相似。 首先是解剖大鼠的安全警示：1.处理标本: 如果使用经过保存的大鼠(非活体)，重要的是要注意保存大鼠的防腐溶液和建议的预防措施。 将保存的大鼠从保存的溶液中取出后，立即用流动的水冲洗。 在通风良好的地方进行实验。 建议戴隐形眼镜的人不要解剖的在防腐溶液中的老鼠。蒸发的溶液可以穿透隐形眼镜刺激眼睛。建议佩戴实体眼镜 考虑处理安乐死或最近解冻或保存的老鼠时的过敏和化学敏感等问题 如果老鼠的胃/肠子被意外切开，要注意从刚刚被安乐死或解冻的老鼠身上可能释放出的微生物气溶胶和难闻的气味。 如果使用冷冻老鼠，请提前在冰箱中解冻一夜，并在24小时内使用。 在任何时候都应遵守良好的卫生习惯:手在实验时远离嘴，鼻，眼以及脸，并在处理解剖材料后立即洗手。 2.解剖刀的使用守则: 手术刀刀片的大小，手柄必须兼容，例如4号手柄和23号刀片。 保持刀片在箔包装和附加到手柄与锋利的刀片指向远离身体。 应小心地使用钳子、镊子或商用刀片拆卸器拆卸刀片。 替代解剖刀的方法是使用一次性手术刀。 3.实验器材 PPE -实验服/围裙(建议使用一次性塑料围裙)、安全眼镜和手套。 手术刀 剪刀 钳 探针 解剖针/针 报纸包裹的解剖板。釉面瓷砖、尼龙塑料板、乙烯基解剖垫或一次性泡沫托盘。 线 纸巾 消毒剂-医院级，通用消毒剂，包装必须注明“医院级”，是一种通用的硬质表面消毒剂会杀死微生物。 70% v/v乙醇(/images/sucai/anatomy/tools.jpg) 实验步骤 首先识别出大鼠头部、胸部和腹部所有可见的外部结构。见Figure 1a. 观察大鼠的口腔和牙齿。 将老鼠背部着地放在解剖托盘上。绳子是用来固定老鼠背部的四肢的。将绳子牢牢地系在一只手腕上，将绳子从托盘下穿过并牢牢地系好另一只手腕。后肢重复这个动作。见Figure 1b. 用镊子夹起腹部中间的皮肤。用钝头向下的剪刀切开皮肤和下面的肌肉。切向肋骨的底部，然后向另一个方向切向生殖器开口。从肋骨底部切下来，然后切到两条后腿。 从下面的肌肉上剥下皮瓣，注意它们之间的结缔组织。用解剖针将老鼠皮肤钉到解剖板上。见Figure \\2. 用钳子提起腹壁，打开腹腔，用剪刀切开，操作步骤与上述步骤4相同。小心不要因为切口太深而损伤腹部的任何器官。 剥去腹壁，用针钉出腹部器官。检查消化器官的原位，并确定所有的结构。注意分散的奶油色脂肪沉积。注意肝脏的大小与腹部的比例。见Figure 3. 切除消化系统的方法是将食道从与胃连接处的上方切开，并切除直肠。注意小肠和大肠相互缠绕的方式。见Figure 4 用手指轻轻撕裂肠系膜，小心地将十二指肠和结肠从结缔组织中拉开，小心地将消化道伸出。测量消化道的长度和大鼠的身体，比较这些数字的比例。见Figure 5. 注意肝和盲肠的大小与大鼠的身体的关系。 小心地取出肝，比较脾和肝的颜色。注意:大鼠无胆囊。 观察暴露的肾脏及相关泌尿器官，以及腹腔内遗留的生殖系统。 见Figure 6. 如果时间允许进行进一步的研究，用钝头剪刀在中腹部切开，向前穿过横膈膜肌肉和胸骨，直到大鼠的下巴。 横膈膜，将胸腔和腹腔分开，可以从胸腔中切掉。 切掉肋骨，露出被一层叫做心包的薄膜包围的心脏，这是位于心脏上部的白色胸腺还有位于心脏两侧的肺。见Figure 7. 摘除心脏和胸腺，以定位气管(气管)的软骨环。食道就在气管的下面。 清理 确保所有仪器都已归还。 老鼠的所有部位和一次性泡沫盘(如使用)必须用报纸包好，并与手套、一次性围裙(如使用)一起放入专用塑料垃圾袋中。当所有废物收集完毕后，用双层袋子处理。如果无法立即处理，应冻结材料。 如果解剖板、剪刀、镊子、探针、解剖针和手术刀上有血液，应立即浸泡在消毒剂中。否则，用热肥皂水清洗设备并漂洗或将设备放入洗碗机中以减少处理。 清洗后的解剖器械可在70% v/v乙醇中浸泡20分钟，作为额外的消毒剂，避免生锈。 彻底干燥所有设备 彻底消毒工作场所及洗手。 以上就是本期奇幻海的全部内容了，希望大家喜欢。&lt;3Reference Gillian Morriss-Kay(2016), The Journal of Anatomy: origin and evolution 5,92021. ASTA,Science ASSIST,Feb 2016 Mason, Stephen F. (1962). A History of the Sciences. New York: Collier. p. 550 Henry Gray.Anatomy of the Human Body.1918 Rotimi, Booktionary. “Anatomy”. Archived from the original on 1 August 2017.","link":"/posts/c83a0197.html"},{"title":"饱和潜水员与潜水钟和死神","text":"Translations for the following languages are also provided:English 前言饱和潜水员(Saturation Diver)是一种鲜为人知的高危职业；在水下超过百米，纯漆黑色的海水中，仅靠几根供给管道与头顶微弱的灯光持续作业。周身被黑暗与未知围绕，感受一阵突如其来的水流，却什么也看不见。在心理压力，不稳定的环境以及有可能因为疏忽而出错的设备下，一点失误就会使这些潜水员在深海中失去生命。 什么是饱和潜水？在水中，深度每增加10米，海水就会对物体增加一个大气压的压力。举个例子，一个充满气的气球在水下10米的体积会比在海平面时更小，而随着深度的增加，气球会越变越小（体积减小，密度增大）。相反的，当气球上浮，气压变小，气球的体积就会增大，离开水时变回原来的体积。 需要注意的是，在水肺潜水时，潜水员是一直在呼吸的。这使惰性气体更多地溶解在血液中，若是快速上升，血液中的气泡体积增大，就会对人体造成不可逆的伤害。这就是为什么规定水肺潜水员在超过30米的潜水中必须进行安全停留。 在1957年，乔治·邦德在海军潜艇医学研究实验室证明了通过饱和潜水，人类实际上可以承受长时间暴露于高压环境中。具体为通过舱内加压，使潜水员体内组织体液中所溶解的惰性气体达到饱和。潜水全在水下可以停留几十天，而之后减压的时间取决于深度，停留时间，以及呼吸的气体，但通常需要花费约半月的时间。意义 饱和潜水使潜水员可以长时间停留在水下作业，这大大节约了成本，也使得潜水员的工作更有效率。潜水员可以在潜水钟的生活舱中待命以应对不时之需。一般需要饱和潜水的领域主要有：海底电缆、油田管道的水下安装,抢险作业。 潜水钟系统饱和潜水使用的是闭式钟台，通过底部的舱口进入水中。但舱体上升时舱口是密封的，以保持内部压力。在水面上，其可以锁定高压氧舱，潜水员在那里饱和或减压。吊钟通过底部舱口或侧舱口与舱室连接，中间的导管增压，使潜水员能够在压力下移动到舱室。在饱和潜水中，钟只是往返工作的交通工具，而舱室系统才是是生活区。一般潜水钟的顶部链接导管和钢缆，导管用于提供氦氧混合气体，供暖，电力。钢缆使船能将潜水钟从海底拉升。如果潜水时间相对较短(弹跳式潜水)，减压可以在钟形舱中进行，方法与在舱中完全相同。 潜在危险后遗症尽管有饱和潜水技术，长期的深海作业依然会对人体带来伤害。英国工业医学杂志曾记载过，40名平均年龄34·9岁(24-49岁)的商业饱和潜水员在他们最后一次深潜(190-500米海水)一至七年后接受了检查。其中四人因为神经问题而失去了潜水执照。潜水员报告的神经系统症状明显更多。注意力集中困难和手脚感觉异常是常见的。通过神经系统检查，他们有更多的神经系统异常表现，与腰椎脊髓或脊髓根的功能障碍相一致。他们的脑电图异常的比例也比对照组大。神经系统症状和发现与深度潜水(包括深度)暴露高度相关，但与空气和饱和潜水和减压病患病率更显著相关。视觉诱发电位、脑干听觉诱发电位、脑磁共振成像均未见明显异常。4名(10%)潜水员在潜水过程中或潜水后出现过脑功能障碍;两人癫痫发作，一人暂时性脑缺血，一人暂时性全身性健忘症。因此，深海潜水可能对潜水者的神经系统有长期的影响。 事故抛开后遗症不谈，在潜水作业中任何一点微小细节的出错，就会要了工作人员的命：没错，不止潜水员，还有船上辅助人员。1983年11月5日比福德海豚事故，北海油田；四名潜水员从作业中返回，离开潜水钟，进入压缩舱的客厅进行减压。尽管所有的工作人员都十分富有经验，在舱外进行分离操作的Crammond却犯下了一个致命的错误(推测)：在没有确认舱门完全密封的情况下就解除了潜水钟的固定装置，在减压舱与外部的巨大气压差下，Crammond被击中直接身亡，其助手身受重伤。而在减压舱内的4名潜水员更为悲惨：9个大气压的环境下瞬间降为1个大气压，使得他们的肺部空气被抽空，造成坍塌。血液中的气体爆裂，使组织堵塞血管，当场身亡。 1979年8月8日的Wildrake潜水事故,北海油田；因为钢缆的断裂，以及指挥人员的错误判断，使链接潜水钟的所有缆绳断裂。由于环境恶劣，19个小时后潜水钟才被打捞上岸，两名在舱内的潜水员：Richard Walker,和Victor死于极度缺氧和寒冷造成的多器官衰竭。而直到8年后，石油公司才承认自己的过失。目前的几起饱和潜水意外多为人为判断失误所造成，其中比福德海豚事故中的挪威政府并没有强制要求公司采用相对成熟的保险闭锁系统。人们对金钱的重视和生命的轻视是值得深思的。但随着各种技术的成熟，希望以后不再会有这类意外的发生。 Citation Todnem, K., et al. “Neurological Long Term Consequences of Deep Diving.” British Journal of Industrial Medicine, vol. 48, no. 4, BMJ, 1991, pp. 258–66. “Byford Dolphin (09092)”. DNV GL Vessel Register. Det Norske Veritas. Retrieved 14 July 2010. Smart, Michael (2011). Into the Lion’s Mouth: The Story of the Wildrake Diving Accident. Medford, Oregon: Lion’s Mouth Publishing. ISBN 978-0-615-52838-0. LCCN 2011915008.","link":"/posts/d894b85c.html"},{"title":"Saturation Diver with Diving Bell and Thanatos","text":"本文同时提供以下语言的翻译:中文 IntroductionSaturation Diver is a little-known high-risk occupation.More than 100 meters underwater, in the pure black water, the operation continues with only a few supply pipes and a faint overhead light.Surrounded by darkness and the unknown,Feel a sudden rush of water and see nothing.With psychological stress, unstable conditions and equipment that can go wrong by negligence, a single misstep can kill these divers in deep water. ##What is saturation diving?In water, for every additional 10 meters of depth, the water exerts an additional atmospheric pressure on the object.For example, a balloon filled with air will be smaller 10 meters underwater than it is at sea level,As the depth increases, the balloon becomes smaller ( and denser).On the contrary, when the balloon rises, the pressure decreases, and the balloon grows in size, returning to its original size when it leaves the water. It is important to note that in scuba diving, the diver is always breathing.This causes the inert gas to dissolve more in the blood, and if it rises rapidly, the volume of bubbles in the blood increases, causing irreversible damage to the body.That’s why it’s mandatory for scuba divers to make a safety stop when diving more than 30 meters. In 1957, George Bond at the Naval Submarine Medical Research Laboratory demonstrated that humans could actually withstand prolonged exposure to high pressure through saturation diving.Specifically through the chamber pressure, so that the dissolved inert gas in the body fluids in the body tissue of divers to achieve saturation.All dives can stay underwater for dozens of days, after which the decompression time depends on depth, residence time, and breathing gas, but usually takes about half a month.##MeaningSaturation diving allows divers to stay underwater for long periods of time, which saves money and makes divers more efficient.Divers can be on standby in the diving bell’s living quarters in case of emergency.Generally, saturated diving is mainly needed in the fields of submarine cable, oilfield pipeline underwater installation, rescue operations. Diving Bell systemSaturation diving uses a closed bell platform that enters the water through a hatch at the bottom.But the hatch is sealed as it rises to maintain internal pressure.At the surface, it locks into hyperbaric oxygen chambers, where divers saturate or decompress.The bell is connected to the cabin through the bottom or side hatch, and a conduit in the middle is pressurized, allowing the diver to move to the cabin under pressure.In saturated diving, the bell is the vehicle to and from work, and the cabin system is the living area.The top of a diving bell is connected to a tube and a steel cable. The tube is used to provide helium-oxygen mixture, heating, and electricity.Steel cables enable the ship to pull the diving bell up from the sea floor.If the dive is relatively short (jump diving), decompression can be done in the bell chamber in exactly the same way as in the chamber. Potential Danger* sequelae *Despite saturation diving, long-term deep-sea operations can still be harmful.The British Journal of Industrial Medicine documented that 40 commercial saturated divers with an average age of 34.9 years (24-49 years) were examined one to seven years after their last deep dive (190-500 m water).Four of them lost their diving licenses because of neurological problems.Divers reported significantly more neurological symptoms.Difficulty concentrating and paresthesia in the hands and feet are common.On neurological examination, they had more neurological abnormalities, consistent with dysfunction of the lumbar spinal cord or spinal root.They also had a greater percentage of abnormal electroencephalograms than the control group.Neurological symptoms and findings were highly associated with deep diving (including deep) exposure, but more significantly associated with air and saturated diving and prevalence of decompression sickness.Visual evoked potential, brainstem auditory evoked potential and magnetic resonance imaging showed no obvious abnormalities.Four divers (10%) experienced brain dysfunction during or after diving;Two had seizures, one had temporary cerebral ischemia, and one had temporary systemic amnesia.As a result, deep-sea diving may have long-term effects on the divers’ nervous system. AccidentsAfter-effects aside, the smallest detail that goes wrong during a dive can kill the crew: not just the divers, yes, but the crew on board.5 November 1983 Beford Dolphin accident, North Sea Oil field;The four divers returned from the operation, left the diving bell and entered the living room of the compression chamber to decompress.Despite all the experience of the crew, Crammond, who performed the extravehicular separation, made a fatal mistake (presumably) :After disarming the diving bell without confirming that the door was fully sealed, Crammond was shot to death by the pressure difference between the decompression chamber and the outside,His assistant was seriously wounded.The four divers in the decompression chamber were even more miserable: nine atmospheres of pressure suddenly dropped to one atmosphere, pulling air out of their lungs and causing them to collapse.The gas in the blood burst, causing the tissue to block the blood vessels, and he died instantly.Wildrake diving accident, 8 August 1979, North Sea Oil Fields;Because of the rupture of the cable, and the misjudgment of the commander, all the cables connecting the diving bell broke.Due to the harsh conditions, it took 19 hours for the bell to be brought to shore. The two divers inside,Richard Walker and Victor, died of multiple organ failure caused by extreme lack of oxygen and cold.It took eight years for the oil company to admit its wrongdoing. Several saturation diving accidents so far have been the result of human errors of judgment, and in the Case of the Biford dolphin, the Norwegian government did not mandate the use of a relatively sophisticated insurance lockout system.It is worth pondering that people attach importance to money and despise life.But as technology matures, hopefully there will be no more accidents like this. Citation Todnem, K., et al. “Neurological Long Term Consequences of Deep Diving.” British Journal of Industrial Medicine, vol. 48, no. 4, BMJ, 1991, pp. 258–66. “Byford Dolphin (09092)”. DNV GL Vessel Register. Det Norske Veritas. Retrieved 14 July 2010. Smart, Michael (2011). Into the Lion’s Mouth: The Story of the Wildrake Diving Accident. Medford, Oregon: Lion’s Mouth Publishing. ISBN 978-0-615-52838-0. LCCN 2011915008.","link":"/posts/f168bf92.html"},{"title":"如何区分鳄目下各科成员？","text":"Translations for the following languages are also provided:English 对大多数人来说，鼍科和鳄科的成员长得很像，他们也的确有许多相同的特性，但如果你能留心一些细节，你就会发现他们的不同。 “鳄目（学名：Crocodilia）通称为鳄鱼，属于脊索动物门蜥形纲。分布于热带到亚热带的河川、湖泊、海岸中，现存24种。”–摘自百科 作为最远可以追溯到三叠纪晚期（楔形鳄科），并鼎盛于侏罗纪与白垩纪的鳄鱼家族，他们以强有力的身体以及两栖（两栖爬行类）的特性在各地位于生态链的顶端。根据研究，鳄鱼在那段时期有大约150个属，而如今只有8个属26种。不过需要区分的是，如今我们所说的鳄鱼拉丁学名是Eusuchia（真鳄亚目，现今鳄目的唯一亚目），译为‘真正的鳄类’。出现于白垩纪晚期，与‘原始’的鳄鱼有显著区别：从上颌骨、上颚和翼骨中形成了一个完整的次级上颚，此外还有一些其它的头颅特征。地球历史进入新生代中新世后，气候逐步开始变的干燥，往日遍布世界的热带雨林逐步变成了草原。这一切对陆地动物的影响非常大，许多新的适应干燥气候的哺乳动物例如猫科、熊科等新食肉类却迅速崛起，占据了食物链的上端。对气候变化的不适应和竞争对手的强大导致了到中新世末期，全球几乎所有大型陆栖鳄鱼和相当多的两栖生活的鳄鱼都已难觅踪迹。（如跑鳄科，平顶鳄科等。） 分类言归正传，如今的鳄目成员被分为了3大科：真鳄科（Crocodylidae）、鼍科【短吻鳄科】（Alligatoridae）、以及食鱼鳄科【长吻鳄科】（Gavialidae）为了给大家一个直观的认知，我会在文章结尾放上现代分类的全览。 鼍科成员与鳄科成员的区别对大多数人来说，鼍科和鳄科的成员长得很像，他们也的确有许多相同的特性，但如果你能留心一些细节，你就会发现他们的不同。先说说真鳄科的成员，Crocodile，一个大家小学时就耳熟能详的单词，指的就是真鳄科的成员（Alligator指的是鼍科）。它们主要分布在非洲、亚洲、美洲和澳大利亚的热带地区，喜欢在淡水中如河、湖和沼泽地中聚集。有时也会生活在半海水中（湾鳄）。PS:根据地理位置与种群分布来进行判断也是一个很好的选择。通常情况下，鳄鱼（鳄科）比短吻鳄（鼍科）更具攻击性，这使得鳄鱼比短吻鳄更危险。短吻鳄是机会主义的捕食者，这意味着除非被激怒，它们一般不会去追你。（pps:还是最好在绝对安全的前提下进行观察(￣、￣)） 嘴形和下颌轮廓可能是区分鳄鱼和短吻鳄最简单的方法，不过有些种的鳄鱼会存在例外，因此可能具有迷惑性。 嘴型：短吻鳄的嘴宽而圆，呈u型，而鳄鱼的嘴又长又尖，呈v型。 颚线:短吻鳄的上颚很宽，这样牙齿就可以藏在嘴里。鳄鱼和短吻鳄在这个意义上是不同的，它们的上下颌骨大小几近相同。图中从上至下依次为：美洲鳄，黑凯门鳄（鼍科），美洲鼍另一种分辨他们的方法是观察他们的牙齿，鳄科成员一个绝对且显著的特征是：下颌第4或第6齿外漏，较长且垂直生长，以至于它们的上颌处有特地的豁口在闭嘴时切合住牙齿。鼍科下鼍亚科与凯门鳄亚科中，鼍亚科成员在上下颚闭合时下齿不外露，而凯门鳄亚科部分成员因为成年后“暴力生长”的原因···部分成员下颚牙齿会在闭嘴时露出。【1】但就算是暴力生长，鼍科成员的上颚并没有凹陷来避开牙齿，因此在野外有时能目击到鼍的下颚牙齿刺穿上颚皮肤继续生长的例子。(牙齿过度生长的凯门鳄) 颈部盾片也是区别鼍科与鳄鱼的一大标准。鼍科所有成员的颈部盾片从脑后连续不断的延伸至背部。而真鳄科成员脑后没有盾片，颈盾与背部盾片断开且不连续。根据鳄鱼的颈部盾片甚至可以更为具体到判断鳄鱼的种类，在这里就不详细展开说了。 总结对比图上方为鼍科代表密河鼍（短吻鳄），下方为真鳄科代表湾鳄。侧视图可以看到密河鼍没有外露的下齿，而湾鳄不仅下齿外露，且有超长的下颚第四齿露出。俯视图可以明显观察到密河鼍U形的吻部和湾鳄V形的吻部，以及湾鳄上颌明显的凹陷处。同时我们也能看到密河鼍颈部盾片从脑后一直连续下去，而湾鳄则有裸露断开的部分。【2】 最后的食鱼鳄科是这三大科中最容易区分的，他们吻部极长，上下齿规律交错。由于和真鳄科关系接近，因而他们的颈盾与背部盾片也是不连续的。 最后放一 张三 个科成员的照片供大家比对 现代分类鼍科（短吻鳄科） Alligatoridae 鼍亚科 Alligatorinae 鼍属 Alligator 鼍（扬子鳄 Alligator sinensis 密河鳄 Alligator mississippiensis 凯门鳄亚科 Caimaninae 凯门鳄属 Caiman 眼镜凯门鳄 Caiman crocodilus 巴拉圭凯门鳄 Caiman yacare 宽吻凯门鳄 Caiman latirostros 古鳄属 Paleosuchus 钝吻古鳄 Paleosuchus palpebrosus 锥吻古鳄 Paleosuchus trigonatus 黑鳄属 Melanosuchus 黑凯门鳄 Melanosuchus niger 真鳄科 Crocodylidae 鳄亚科 Crocodylinae 鳄属 Crocodylus 美洲鳄 Crocodylus acutus 非洲狭吻鳄 Crocodylus cataphractus 奥利诺科鳄 Crocodylus intermedius 澳洲淡水鳄 Crocodylus johnstoni 菲律宾鳄 Crocodylus mindorensis 危地马拉鳄（莫瑞雷鳄） Crocodylus moreletii 尼罗鳄 Crocodylus niloticus 新几内亚鳄 Crocodylus novaeguineae 沼泽鳄 Crocodylus palustris 湾鳄 Crocodylus porosus 古巴鳄 Crocodylus rhombifer 暹罗鳄 Crocodylus siamensis 西非尼罗鳄Crocodylus suchus 侏鳄属 Osteolaemus 侏鳄 Osteolaemus tetraspis 狭吻鳄属 Mecistops 非洲狭吻鳄 Mecistops cataphractus 细嘴狭吻鳄 Mecistops leptorhynchus 食鱼鳄科(长吻鳄科) Gavialidae 切喙鳄属 Tomistoma 马来长吻鳄 Tomistoma schlegelii 长吻鳄属 Gavialis 恒河鳄 Gavialis gangeticus CitationEverglands,The Difference Between Alligators and Crocodiles,https://www.evergladesholidaypark.com/alligators-and-crocodiles/#:~:text=Physical%20Differences&amp;text=Snout%20Shape%3A%20Alligators%20have%20a,%2Dshelled%20vertebrates%2C%20like%20turtles. July,12,2021Schwimmer, David R. The Size of Deinosuchus. King of the Crocodylians: The Paleobiology of Deinosuchus. Indiana University Press. July,11,2021James P. Ross. Heinz Fritz Wermuth, Evolution and classification, Britannica,https://www.britannica.com/animal/crocodile-order/Evolution-and-classification, July,11,2021Paxingtianxia,(Crocodile face blindness treatment paste) take you to distinguish 24kinds of crocodiles in the world (upper · true crocodile family), freewechat, https://freewechat.com/a/MzI1Nzc3OTE1OA==/2247514655/1, July,12,2021注【1】【2】摘自爬行天下，【鳄鱼脸盲症治疗贴】带你分清全世界24种鳄鱼（上 · 真鳄科）","link":"/posts/fef3ca0d.html"}],"tags":[{"name":"Photography","slug":"Photography","link":"/tags/Photography/"},{"name":"Art","slug":"Art","link":"/tags/Art/"},{"name":"Knowlege","slug":"Knowlege","link":"/tags/Knowlege/"},{"name":"greet","slug":"greet","link":"/tags/greet/"},{"name":"knowledge","slug":"knowledge","link":"/tags/knowledge/"},{"name":"Diving","slug":"Diving","link":"/tags/Diving/"},{"name":"淡水","slug":"淡水","link":"/tags/%E6%B7%A1%E6%B0%B4/"}],"categories":[]}