{"pages":[{"title":"","text":"google-site-verification: googleac013a5b33be326a.html","link":"/googleac013a5b33be326a.html"},{"title":"","text":"个人简介 分享很喜欢的老罗的一段话： “每一个生命来到世间都注定改变世界，别无选择。要么变得好一点，要么变得坏一点。你如果走进社会为了生存为了什么不要脸的理由，变成了一个恶心的成年人社会中的一员，那你就把这个世界变得恶心了一点点。如果你一生刚正不阿，如果你一生耿直，没有做任何恶心的事情，没做对别人有害的事情，一辈子拼了老命勉强把自己身边的几个人照顾好了，没有成名没有发财，没有成就伟大的事业，然后耿着脖子一生正直，到了七八十岁耿着脖子去世了。你这一生是不是没有改变世界？你还是改变世界了，你把这个世界变得美好了一点点。因为世界上又多了一个好人。“ 善恶终有报,天道好轮回。不信抬头看,苍天饶过谁。无论何时何地，我们都要保持一颗积极乐观、善良感恩的心。但行好事莫问前程，永远年轻，永远热内盈眶，永远保持正能量。💪💪💪💪💪💪冲鸭！！！！ -&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;个人信息：海洋生物爱好者 博客信息 网站采用的Icarus主题 追求尽可能的简洁，清晰，易用。 在Icarus主题之上进行了部分修改。 更新日志：–2020.09.20：icarus4.0适配–2020.01.18：icarus3.0适配–2019.11.17：增加深色主题开关–2019.10.30：去图，精简卡片–2019.10.22：改版部分显示，优化速度–2019.10.16：文章列表加上评论数显示–2019.10.13：改版评论–2019.09.25：图片、资源接入CDN免费jsDelivr、文章加入置顶–2019.09.19：开源博客代码–2019.09.19：修改布局，拉伸布局，更宽的展示–2019.09.18：修改友链ui为一行三个，并适配移动端，暗黑模式文章增加评论链接，增加留言链接–2019.09.14：增加精简next主题–2019.09.14：利用中秋节放假，重做了首页的热门推荐、加个widget最新评论框、归档页加入文章贡献概览面板 本站推荐索引 博客主题相关 github Issue 作为博客微型数据库的应用 github page网站cdn优化加速 博客源码分享 博客换肤的一种实现方式思路 博客中gitalk最新评论的获取 博客图片上传picgo工具github图传使用 安装、部分配置icarus主题中文版 技术知识点 Java并发知识点 其他 网易云音乐歌单分享 计划2020计划 2019.12.31 2020-GOALS 跑两三场马拉松 2019计划 2018.12.31/21:59:00-&gt;更新于2019.12.31 2019-GOALS 购买的专业书籍至少看完一遍（并发、重构、设计模式…）-&gt; 95% 额外： 追了很多剧 总结： 有优点有缺点，没坚持下来的还是太多，追了太多剧。以后多学习，多思考！ 时间轴记录","link":"/about/index.html"},{"title":"","text":"71e998dd83e418dd2a15218e887fa75c","link":"/baidu_verify_code-tliDpracF6.html"},{"title":"","text":"来而不往非礼也畅所欲言，有留必应","link":"/message/index.html"},{"title":"音乐歌单收藏","text":"温馨提示：选择喜欢的音乐双击播放，由于版权原因部分不能播放。如果喜欢歌单收藏一下，去网易云都能播放哟！","link":"/music/index.html"},{"title":"","text":"🎈🎈MY Album🎈🎈 > **Featured** Garden Dream and nature Wild Life Deep Blue Corals ©Personal photos, all copyrights to the website @ Yansheng Luo","link":"/album/index.html"}],"posts":[{"title":"2022年水下摄影大赛获奖作品","text":"自2015年起，为传承始于英国的布莱顿水下电影节，Alex Mustard, Dan Bolt ，Peter Rowlands与他们的网站Underwaterphotographer创办了年度水下摄影大赛（UPY），恢复了几十年前英国举办的大型国际水下比赛的传统。 水下摄影大赛共设有 13 个类别，包括微距、广角、行为、沉船以及海洋保护等，其中有四个类别专门针对英国水域。 让我们共同欣赏来自世界各地摄影师所呈现的艺术吧。 首先是获得‘2022年度水下摄影师’的作品 Dancing with the giants of the night（与夜之巨人们共舞）获奖者是来自西班牙的Rafael Fernandez Caballero这张照片同时也是广角组的冠军 ‘2022年度水下摄影师亚军’’Supernova in paradise’ （’超新星在天堂’）作者是同样来自西班牙的Quico Abadal ‘2022英国年度水下摄影师’’ A 3.5m great white curiously approaches my lens’（’一条3.5m的大白鲨好奇地靠近我的镜头’）(这名字够直白的。。) PS: 这个头衔相当于年度水下摄影师亚军获奖者为来自澳大利亚的Matty Smith该作品同时为行为组亚军 2022年最有前途的英国水下摄影师 ‘Diamonds and Rust’(‘钻石与锈迹’)获奖者Paul Pettitt (英国) 我的后院奖2022 ：’All You Need Is Love’ （’你所需要的只是爱’）芬兰作者Pekka Tuuri 同时也是行为组冠军结合图中内容有点出戏。。。 “拯救我们的海洋”基金会 2022年年度海洋保护摄影师: ‘Season of anchovy fishery’ (‘凤尾鱼捕捞季’)Thien Nguyen Ngoc (越南) 以上就是特殊提名的奖项了，接下来为大家展示各个专题组的获奖者：广角 亚军：Sunset Ray （’日落光线’）ps: 英文中光线Ray和鳐鱼的Ray为同一词Andy Schmid (瑞士) 季军：’Against All Odds’（困难重重）Hannah Le Leu (澳大利亚) 高度推荐：’The great mother’（伟大的母亲）Daisuke Kurashima（日本） 微距 冠军：’Mimicry’ （’伪装’）Javier Murcia (西班牙) 亚军：’City of Angels’ （’天使之城’）David Alpert (英国) 季军：’Green Fire’ （’绿火’）Hannes Klostermann (墨西哥) 高度推荐：’Halloween’ (‘万圣节’)Ipah Uid Lynn (马拉西亚) 沉船组 冠军：’Abandoned ship’ （’被遗弃的船’）Alex Dawson (瑞典) 亚军：’Glassfish Synchronicity’ （’玻璃鱼同步性’）Catherine Holmes (英国) 季军：’Coral on the Kittiwake’ （’基蒂威克岛上的珊瑚’）Karlo Macas (克罗地亚) 高度推荐：’The Captain Dan at Night’ （’夜晚的船长丹’）Jack Israel (美国) 行为组 亚军：’The circle of life’ （’生命循环’）avier Murcia (西班牙) 季军：’Hunting’ （’狩猎’）Damir Zurub (克罗地亚) 高度推荐：’Take Cover’ （’掩护’）Luke Gordon (英国) 肖像组 冠军：’Rapunzel on Fire’ (‘长发公主着火了/火力全开’)Thomas Heckmann (德国) 季军：’Longevity Meditation’ （’长寿冥想’）Daniele Comin (意大利) 高度推荐：’Magical Fairy Wisps’ （’仙女的一缕’）Jenny Stock (英国) 黑白相片 冠军：’Sarah’s Underwater World’ （’莎拉的水下世界’）Kerrie Burow (澳大利亚) 高度推荐：’Floating Mountains’ （’浮空山’）Martin Broen (美国) 推荐：’Freedom’ （’自由’）Nicolas Hahn (阿根廷) 以上就是部分我觉得最为惊艳的作品了，如果你觉得意犹未尽可以去访问他们的官网：Underwater Photographer of the Year 希望大家能感受到海洋的魅力 最后还请点个赞QAQ","link":"/posts/f6eea7bf.html"},{"title":"2021年水下摄影大赛获奖作品","text":"自2015年起，为传承始于英国的布莱顿水下电影节，Alex Mustard, Dan Bolt ， Peter Rowlands与他们的网站Underwaterphotographer创办了年度水下摄影大赛（UPY），恢复了几十年前英国举办的大型国际水下比赛的传统。此次摄影大赛共设有 13 个类别，包括微距、广角、行为、沉船以及海洋保护等，其中有四个类别专门针对英国水域。比赛汇集了来自全球 68 个国家和地区摄影师的 4500 多张作品。下面让我们共同欣赏来自世界各地摄影师所呈现的艺术吧。 自2015年起，为传承始于英国的布莱顿水下电影节，Alex Mustard, Dan Bolt ， Peter Rowlands与他们的网站Underwaterphotographer创办了年度水下摄影大赛（UPY），恢复了几十年前英国举办的大型国际水下比赛的传统。此次摄影大赛共设有 13 个类别，包括微距、广角、行为、沉船以及海洋保护等，其中有四个类别专门针对英国水域。比赛汇集了来自全球 68 个国家和地区摄影师的 4500 多张作品。下面让我们共同欣赏来自世界各地摄影师所呈现的艺术吧。 2021年度水下摄影奖&amp;广角组冠军（Wide Angle）Winner:’Sharks’Skylight’ Renee Capozzola(USA) 广角组亚军(runner up): ‘Gothic Chamber’ Martin Broen(USA) 季军(thrid):’Jellyfish galore’ Oleg Gaponyuk(Russain) Highly Commended 'RED DOT' Tobias Friedrich(Germany) 'Upside down' Alvaro Herrero(Spain) 微距组（Marco）冠军：‘Pontohi pigmy seahorse’(彭氏豆丁海马) Galice Hoarau(Norway) 亚军:’Larval Lionfish’(幼体狮子鱼/蓑鲉) Steven Kovacs(USA) 季军:’Dream ship’ Chien-ting hou(Taiwan) Highly Commended 'Xenia piperhorse'(Xenia类海龙) Dr Alex Tattersall(UK)ps:【海龙英文为pipefish,有一种学说认为Pipehorse是海龙（pipefish）与海马（seahore）之间的进化纽带】 'Rainbow Angel'(彩虹天使(海鞘)) Viktor Lyagushkin(Russian Federation) 'The Fastest Nudy'(海蛞蝓) Fabio Iardino(Italy) 沉船组（Wrecks）冠军:’BOWLANDER’ Tobias Friedrich(Germany) 亚军:’Reclaimed by the Ocean’ Grant Thomas (UK) 季军:’Golden Hour at the Georgios’ Renee Capozzola (USA) Highly Commended 'VERTIGO(晕头转向)' Tobias Friedrich (Germany) 'Lift off' Grant Thomas (UK) 行为组（Behaviour）冠军:’A striped marlin in a high speed hunt in Mexico’ Karim Iliya (USA) 亚军:’Face to face’ JingGong Zhang (China) 季军: ‘Milk feeding’ Mike Korostelev (Russian Federation) Highly Commended 'The Last Waltz' Ralph Pace (USA) 'Orcas predating a thresher shark' Rafael Fernandez Caballero (捷克共和国) 'Embrace' João Rodrigues (Portugal) 'The next generation' Tammy Gibbs (Australia) 肖像组（Portrait）冠军:’Guardian Deity’ Ryohei Ito (Japan) 亚军:’Japanese manefish(日本鲷鱼)’ Keigo Kawamura (Japan) 季军:’French Angel’ Michael Gallagher (UK) Highly Commended 'Eye contact with humpback whale' Mike Korostelev (Russian Federation) 'Critically endangered cuban crocodile in a cenote' Anita Kainrath (Austria) 'Snooty the lemon shark' Galice Hoarau (Norway) 卡片机组（Compact）冠军:’Doule (Kuhlia Rupestris) near the surface’ Jack BERTHOMIER (New Caledonia) 亚军:’Rainbow Goby’ ManBd (Malaysia) 季军: ‘Pelagic stingray (Pteroplatytrygon violacea)’ Isaías Cruz (Spain) Highly Commended 'Toad tadpole on water lily leaf' Andrea Falcomatà (Italy) 'Life drop' Chiara Scrigner (Italy) 'The Orchid' ManBd (Malaysia) 英国水域广角组(British Waters Wide Angle)冠军:’While You Sleep’ Mark Kirkland (UK) 亚军:’The Great Migration’ Mark Kirkland (UK) 季军:’Grey seal gully’ Kirsty Andrews (UK) Highly Commended 'The gannet and the mackerel Richard Shucksmith (UK) 本文内容精选于UPY 官网，如果感兴趣的话，朋友们可以点进去欣赏更多作品。","link":"/posts/9b6854e5.html"},{"title":"Art Works for Marine","text":"住在海边，可惜一直没有机会一探海中的风情，只能依靠想象简单画出了两幅图Live in the seaside, regrettably did not have the opportunity to explore the amorous feelings in the sea all the time,can only rely on imagination to draw two pictures simply.软件：Krita","link":"/posts/82df373d.html"},{"title":"于沙滩上坠落的繁星-生物发光现象","text":"Translations for the following languages are also provided:English 前言从广为人知的萤火虫，到深海中的𩽾𩾌鱼，再到静谧的夜光藻，之于沙滩之上宛如繁星落入海中，生物发光现象其实就在你我的身边。毫无疑问，生物发光是自然界中一种惊人而又美丽的现象。它为人类打开了一道对生物功能崭新的大门，至今仍被研究者们怀着敬畏与好奇之心观察。 对生物发光现象的研究最早可以回到1667年，波以耳(Boyle英国化学家，近代化学的奠基人)的研究发现了生物发光对氧气的需求：当时波以耳发现，拥有生物发光能力的鱼和由于细菌和真菌感染的木材发出的光需要氧气。他利用真空泵观察到：‘一块闪光的木头……发出明亮的光。这显然减少了……吸到第七次的时候，空气被抽得越来越多，光线也越来越暗……因此，我们让外面的空气进来，很高兴地看到那似乎已耗尽的光恢复得那么快，那么完美，在我们看来，简直像一道直劈到19世纪的小小闪电。’此外，到了19世纪，基于波以耳对其他生物发光系统的研究表明了两种成分的存在：荧光素和荧光素酶-这两种成分对所有生物发光反应而言都是必不可少的。简单来说，生物发光，这一化学反应可以这样来表示：荧光素和氧气在荧光素酶的催化下生成氧化荧光素，同时发出光亮。 为什么生物会发光？无论我们能多好地解释生物发光的原理，但对生物发光现象的存在的回答仍然需要很多的思考。生物发光似乎不会提供任何普遍的进化优势。像萤火虫这样发光的物种，作为昆虫，并不比那些使用不同的机制(不依赖发光)来引起同样的生物反应(例如，通过荷尔蒙或颜色信号来吸引同伴交配)的物种更成功。有人提出，发光是偶然产生的，可能是由于作为主要或次要代谢途径的一部分的底物氧化。作为这种氧化的结果，一个包含有机过氧化物和高荧光分子(可能是氧化还原辅助因子，如细菌系统中的FMN)的系统产生了，能够进行进一步反应产生光。这种情况类似于偶然发现的一些化学发光化合物，只是因为它们在碱中溶解，然后与氧反应。不管生物发光的起源是否属于这类偶然事件，很明显，许多物种已经通过多种方式适应了这种现象。 几个有趣的小知识发光生物种类的巨大多样性事实上是令人瞩目的。虽然发光生物的数量与已知种的总数相比是少之又少。 但含有至少一种发光种的门或纲的比例却惊人的大：在25个门中，就有13个门中有可以进行生物发光的物种，而在这些门中，又有25个包含发光生物的纲。例如菌门中的细菌，真菌原生动物。这样看来发光现象似乎没有沿着任何进化路线发展，而是在整个门中偶尔出现。比如说一个属中的物种可能是会发光的，但一个非常接近的物种却没有发光现象。在另一些情况下，物种的幼鱼有发光的能力，但是成年后却失去了这一种能力。只有在虾、鱼和鱿鱼这些拥有复杂发光器官(光体)的动物中，才能看到复杂性不断增加的趋势。 交叉反应有趣的是，交叉反应会出现在不同物种的发光反应中：一个物种的荧光素可以和另一个物种的荧光素酶发生反应，从而发光。这一现象主要出现在关系相近的物种中。但是却有一个例外：杓兰（Cypridina一种甲壳类动物）和一种副单鳍鱼(Parapriacanthus)。如果不会发光的副单鳍鱼被喂含有荧光素的杓兰，他们会变得完全拥有荧光反应能力。 上图为杓兰副单鳍鱼腔肠类荧光素与发光乌贼Watasenia和十足虾Oplophorus也存在类似的关系。 研究的障碍对生物发光感兴趣的现代实验家遇到的问题之一是很难获得所需的大量标本。现在，由于更详细和详尽的检查是必要的，可能需要数以万计的生物产生几毫克高纯度的荧光素。而这些荧光素往往很难获得，例如，在月圆后的几天里，海生蠕虫齿根虫只会大量出现30分钟左右，这时就需要有大量配备手网的人员来采集。此外，这些荧光素经常出现在众多污染物中，而研究人员很难从中提取样本。最后，希望日后的科技能对对荧光生物研究的困扰有所帮助。 CitationNeary, A. P., and C. S. J. Walpole. “Bioluminescence-Chemical Light.” Science Progress (1933- ), vol. 70, no. 2 (278), Temporary Publisher, 1986, pp. 145–69.","link":"/posts/904bb79f.html"},{"title":"带你了解不同等级的潜水员证都会学些什么","text":"Translations for the following languages are also provided:English 对潜水感兴趣的或者已经打算开始朋友们，你们是否对琳琅满目的潜水证等级划分感到迷惑呢？ 下文将解释不同等级的潜水证你可以学到的东西和解禁的元素。 目前关于国际休闲潜水的机构繁多，一般常见且被潜店认可的有：ADIP:国际潜水教学系统 (Association Des Instructeurs de Plongée)，1997年成立NAUI:水中教练国际协会（National Association of Underwater Instructors），1960年成立PADI:（Professional Association of Diving Instructor），1966年成立，现今为发卡数量最多的系统SSI:国际水肺潜水学校（Scuba Schools International），1970年成立，现今为发卡数量第二多的系统CMAS:国际潜水员协会 （Confederation Mondiale des Activities Subaquatiques），1958年成立ADS:国际潜水学校联盟（Association of Diving School）1988年成立SDI/TDI:国际水肺/技术潜水（Scuba Diving International/Technical Diving International）1994年由当时世界上经验最丰富的几位潜水教练成立CDDA:中华潜水推广协会 (Chinese-Taipei Diving Development Association) ，1967年成立DIWA:迪华世界潜水教练协会 (Diving Instructor World Association) ，1972年成立 有趣的是不同的组织对不同等级的潜水证的叫法是不同的，比如SSI对进阶开放水域潜水员的称呼为Advanced Adventure(进阶的冒险者)，而PADI对其的称呼为AOW(Advanced open water diver).不过不同机构的潜水证一般是可以对照的，并且都被潜店认可： 这里将以PADI,最有名的组织为例，来介绍其整个系统的等级划分。PADI潜水员教育系统是潜水中最具指导性的系统一般来说，PADI整套流程从入门到极致是这样的：15岁以上可以学习OW（Open Water Diver）☛之后可以进阶成为AOW(Advanced Open Water Diver),这个等级就可以基本满足所有的休闲潜水景点的需求了。同时你也可以选择再进一步得到Rescue Diver的认证，即救援潜水员。这样你就有了资格成为MSD(Master Scuba Diver)。此外你也可以选择进入PADI的系统，走上潜水教练的道路: 即PDM潜水长(PADI DIve Master)持有潜水长执照的潜水员可以从事潜水导游或协助潜水教学的训练工作；下一级为Open Water Scuba Instructor,即开放水域水肺教练，此时就可以成为一名真正的潜水教练，并独立完成教学(所有此等级一下的课程，专业课除外)。再往上还有教学长，课程总监这里就不一一赘述了。这就是PADI最主要的升级线路了，除此之外还有众多的专业课程可供选择(水下摄影，干衣潜水，高氧潜水等)。 OW 级别：作为PADI最基础的潜水等级，OW允许你最深可以潜到18m的水下。受训的潜水员将学习基础的潜水装备、潜水技巧、潜伴这一安全规则和其他的基础的安全知识。 AOW级别：你可能需要AOW的一大原因是更大的深度：AOW能使你潜入最多30m深的海中，感受色彩的变化，离水面原来越远的静谧感。AOW级别可以说是将ow时学会的技巧全部熟练掌握，并且更进一步的课程，你将能够使用水下指南针，了解氮中毒，安全停留等知识，最终的目的是你能够在没有潜水向导的情况下完成更深的潜水。同时你也可以学习更多的专业课程。 PADI Master Scuba Diver:如果某人是Master Scuba Diver，这意味着他们有丰富的经验和水肺训练(至少50潜）。他们会花很多时间在各种不同的水下环境中，从夜间潜水到深海潜水。只有不到2%的潜水员达到了这个等级，这使他们成为了精英群体。追求MSD也改变了人们的生活，帮助他们学习新技能，增强信心，促进海洋保护，并关注他们的身心健康.","link":"/posts/672b810e.html"},{"title":"河鲀、刺鲀是怎么变得圆滚滚的？","text":"Translations for the following languages are also provided:English 前言众所周知，在鲀形目中，使身体膨胀的奇异能力在四齿鲀科(河豚和尖鼻河豚)和二齿鲀科(刺河豚)的所有成员中都可见。当她们察觉到危险时便会以迅速膨胀作为防御手段来抵御捕食者的攻击(这使得捕食者很难吞下膨胀的身体).在膨胀的过程中，通过反复地将一口一口的水或空气灌进一个可膨胀的胃里，河鲀就能快速膨胀。那么具体从物理上的角度来讲，鲀是如何做到吸水膨胀的呢？膨化时鲀的胸带和头部有明显的变化并起到了关键的作用。 以河鲀为例：在每个膨胀周期开始时(可以理解成河豚每吸入一口水或空气)，颊压降低（该时期与几块肌肉的活动有关），这些肌肉使河豚的嘴部张开(提上肌、扩张肌)，压迫舌骨器官(外展舌骨肌、胸舌骨肌)，并收缩胸肌带(提胸肌)。正颊压期间，水被强迫进入胃；此时下颌内收(下颌内收肌)，舌骨和胸肌带牵伸。为了便于理解，这一过程就好比帮浦机制：当挤压帮浦时（负颊压），帮浦内气体体积随帮浦体积一起减小。而当松开帮浦（正颊压），帮浦复原，此时帮浦内的气压就变小了，水就因为气压差进入帮浦。河鲀的腹面和侧面皮肤是可以高度伸展的，此外河豚没有肋骨，这允许了其能承受极端的形状变化。河鲀的膨胀行为涉及到头部的特殊功能形态，其拥有高度活跃的关节，它允许大范围的胸带的伸展和收缩。以及发达的外展肌，可以弯曲第一鳃骨之间的关节，提供了一种新的颊底凹陷机制。总而言之，归于这种特殊的机制，大部分鲀们都能借此从捕食者口中逃过一劫。除了被海豚当球踢的那种。。 Citation:1.Wainwright, Peter C., and Ralph G. Turingan. “Evolution of Pufferfish Inflation Behavior.” Evolution, vol. 51, no. 2, [Society for the Study of Evolution, Wiley], 1997, pp. 506–18.2.Wainwright, Peter C., et al. “Functional Morphology of Pufferfish Inflation: Mechanism of the Buccal Pump.” Copeia, vol. 1995, no. 3, [American Society of Ichthyologists and Herpetologists (ASIH), Allen Press], 1995, pp. 614–25.","link":"/posts/981b252b.html"},{"title":"What would you learn from different levels of Scuba Diving Courses?","text":"本文同时提供以下语言的翻译:中文 If you are interested in diving or already planning to start diving, are you confused by the various levels of diving certification?What follows is an explanation of what you can learn at different levels of diving certification and the elements of lifting the ban. At present, there are a variety of international recreational diving organizations, which are generally common and recognized by diving shops:ADIP:国际潜水教学系统 (Association Des Instructeurs de Plongée)，1997年成立NAUI:水中教练国际协会（National Association of Underwater Instructors），1960年成立PADI:（Professional Association of Diving Instructor），1966年成立，现今为发卡数量最多的系统SSI:国际水肺潜水学校（Scuba Schools International），1970年成立，现今为发卡数量第二多的系统CMAS:国际潜水员协会 （Confederation Mondiale des Activities Subaquatiques），1958年成立ADS:国际潜水学校联盟（Association of Diving School）1988年成立SDI/TDI:国际水肺/技术潜水（Scuba Diving International/Technical Diving International）1994年由当时世界上经验最丰富的几位潜水教练成立CDDA:中华潜水推广协会 (Chinese-Taipei Diving Development Association) ，1967年成立DIWA:迪华世界潜水教练协会 (Diving Instructor World Association) ，1972年成立 What is interesting is that different organizations have different names for different levels of diving licenses. For example, SSI calls Advanced Adventure for Advanced open water divers, while PADI calls AOW for Advanced Open Water Diver.However, diving licenses of different institutions are generally comparable, and are recognized by dive shops: Here we will use PADI, the most famous organization, as an example to describe the hierarchy of the entire system.PADI Diver education system is the most instructional system in divingIn general, the PADI process from beginning to end looks like this:When you are over 15 years old, you can learn OW(Open Water Diver), and then you can enter AOW(Advanced Open Water Diver), which can basically meet the needs of all recreational diving spots.You can also choose to be further certified by Rescue Diver, which is a Rescue Diver.That would qualify you for an MSD.In addition, you can choose to enter the PADI system and follow the path of DIve instructor: PADI DIve Master divers with a DIve Master license can work as DIve guides or assist with DIve instruction training;The next level is Open Water Scuba Instructor, at which point you can become a real Scuba Instructor and complete the teaching independently (all courses below this level except specialized courses).Then there are the dean, the course director is not a repeat here.This is the main upgrade route for PADI, in addition to the numerous professional courses available (underwater photography, dry clothes diving, high oxygen diving, etc.). OW levels:PADI’s most basic dive class, OW allows you to dive to depths of up to 18m.Trained divers will learn basic diving equipment, diving techniques, companion safety rules and other basic safety knowledge. AOW level:One reason you might want an AOW is more depth: it allows you to dive up to 30m deep and feel the change in color, the quiet feeling of being farther away from the surface.The AOW level allows you to master all the skills you learned while you were in the ow, and further, you will be able to use an underwater compass, learn about nitrogen poisoning, safe stays, etc. The ultimate goal is to be able to do deeper dives without a dive guide.At the same time, you can learn more specialized courses. PADI Master Scuba Diver:If someone is a Master Diver, it means they have extensive experience and Scuba training (at least 50 dives).They spend a lot of time in a variety of different underwater environments, from night diving to deep sea diving.Less than 2% of divers reach this level, making them an elite group.Pursuing MSD also changes people’s lives, helping them learn new skills, boosting confidence, promoting Marine conservation, and focusing on their physical and mental health.","link":"/posts/4be9a7a8.html"},{"title":"Welcome To Fantacy Sea","text":"这是一个关于海洋知识的博客，我会为大家展示奇妙的海中世界。欢迎大家关注&gt;_&lt;","link":"/posts/c77b8e29.html"},{"title":"wrecks - Artificial coral reefs and ecosystems","text":"本文同时提供以下语言的翻译:中文 PreambleWhen a ship completes its service, it finally sinks to the bottom.It completed its initial value, but then went to rest in the water with a new story - the passage of time brought waves of coral and other plants, which in turn attracted fish and predatorsA budding ecosystem was born. Artificial ReefsThousands of years ago, people in temperate coastal areas have been known to use bamboo or wooden structures to attract gathering schools of fish (FADs). Of course, this structure was not designed to protect Marine biodiversity, but it is an inspiration for ecosystem restoration. As a coral restoration scholar, Charles Darwin observed that by attaching detached corals to the aforementioned FADs, the corals could successfully survive and grow.Although this structure is not a very effective artificial reef, this example shows that artificial reefs can provide a good environment for corals to grow. Effects of wrecks as artificial coral reefsIn the 1970s and 1980s, people began sinking objects into the ocean floor to act as artificial reefs. This includes concrete blocks and boats of all sizes. Artificial reefs have a material requirement: they must be strong enough to withstand possible hurricanes and currents. Artificial reefs also need to be made of iron or concrete to prevent toxins from contaminating water sources. Boats, it seems, are the perfect substrate for an artificial reef. Many artificial reef projects are sinking abandoned vessels that provide habitats for corals and other plants and animals on the seabed, allowing otherwise hard bottoms to flourish. The retired Coast Guard cutter Duane sank off Florida in 1987 Shipwrecks seem to be beneficial to the undersea ecosystem rather than harmful. In fact, there are many factors that make shipwrecks unhelpful or even counterproductive to the local ecosystem: Artificial reefs require the same environmental water quality as natural reefs, which means they can only be formed quickly on the seabed with good water quality. On the other hand, such as accidental sinking of ships, there is often the problem of oil spills to pollute the water and pollute the local waters. Such pollution often takes decades to recover. In fact, 70 percent of shipwrecks date back to World War II, and several studies have suggested that over the years, the rust on ships can contaminate the environment with acid. The impact of these wrecks on the ecology of the seafloor is questionable, of course, because corals and other plants still inhabit them. And the analysis of carbon and nitrogen isotopes showed that the artificial reefs did indeed increase local secondary biomass production: that is, they did not just harbor fish and other heterotrophic organisms, but actually increased heterotrophic populations. Issues remained Since the increase in attention to natural ecology in the late 20th century, many people have realized the value of artificial coral reefs. As mentioned above, people began to sink objects at the bottom of the sea. So in the name of artificial reefs, companies are dumping lots of waste on the sea floor at low cost: bits of building material or tyres. These materials are either too smooth for corals to live in, too small to be blown away by hurricanes, or continue to release toxic substances. Take Florida’s Osborne Reef in the 1970s: tens of thousands of tires do nothing to support coral, instead covering large areas of the seabed. As a measure to restore coral populations, maintain species diversity and protect their research value, artificial coral reefs still face many challenges. All kinds of bold hypotheses and experiments are the ladder to achievement, but the use and greed of this excuse will bring indelible damage to the environment. Citations:[1]Cresson, Pierre, et al. “Artificial Reefs Do Increase Secondary Biomass Production: Mechanisms Evidenced by Stable Isotopes.” Marine Ecology Progress Series, vol. 509, 2014, pp. 15–26. JSTOR, https://www.jstor.org/stable/24894662. Accessed 24 Jun. 2022.[2]Assembly, P. (2012). The environmental impact of sunken shipwrecks. PACE website. Retrieved June 23, 2022, from https://assembly.coe.int/nw/xml/XRef/Xref-XML2HTML-en.asp?fileid=18077&amp;lang=en[3]New Heaven Conservation Program. (n.d.). Artificial Reefs: What works and what doesn’t [web log]. Retrieved June 4, 2022.","link":"/posts/f0e6952a.html"},{"title":"你知道鱼类也有雌雄同体吗?","text":"Translations for the following languages are also provided:English 前言鱼类雌雄同体以及鱼类变性的研究是一个很少有人专注的主题，目前的研究结果很有可能得到修改或者更正，也希望学者们能在这个领域得到突破。 在硬骨鱼纲中，个体性别的改变是非常常见的。许多的鱼类虽是雌雄异体，并且有成对的生殖腺。也就是说他们要么只有一对卵巢，或是一对精巢。 但是由于多数鱼类体外受精的繁殖方式，使得他们可以改变自己的性别，即两性二态性。鱼类会分泌激素，将未发育的腺体发育成卵巢或者是精巢。红鲷鱼就是一个很好的例子，一个红鲷鱼群由1条雄鱼和几十条雌鱼构成。雄性红雕鱼处于领导位置，带领种群觅食，保护种族安全以及交配。一旦雄鱼死亡，剩下的红雕鱼雌性中最大的个体就会发育成雄性，继续带领族群。而这一过程叫做变性。 雌雄同体不过在对过去的三千多种鱼类样本进行研究后，可以肯定的是，所有被作为样本的鱼类都是单性的–他们虽然会变性，但是不会出现雌雄同体的现象。但是在伍兹霍尔实验室的研究中，偶然发现了例外：在克鲤鱼属的條帶底鱂中，可能发现了雌雄同体的现象。在讨论具体的细节前，请大家先了解一下鱼类两性之间拥有的的第二性征。虽然不同种的鱼类区别性别的元素也有所不同但主要有以下几个方向：体型：不同的鱼类有不同的情况，一般在成熟的个体中，有些种群的雄性较大，比如上文提到的红雕鱼。也有些是雌性比雄性大，比如條帶底鱂。花纹，颜色通常来说，鱼类雌雄个体之前的花纹，或者颜色都有区别，雄性红雕鱼的颜色就比雌性更加鲜艳。 而在條帶底鱂中，两种性别的身体颜色模式完全不同;雄鱼由明显的横带组成，从头部后部一直延伸到尾鳍基部附近;另一方面，雌性的身体则主要由明显的纵向条纹组成，前部完美，后部与雄性的交叉条纹相融合。PS：交叉条纹模式是该物种的原始模式，所有的未成熟的鱼，无论性别，出生时都是这种图案。行为：在产卵季节，條帶底鱂雄性的行为与雌性形成了鲜明的对比。前者精神抖擞，好斗，经常跟在雌性后面，以便与它们产卵。 特例的发现1907年 6月3日，伍兹霍尔海洋研究所的研究者选取了一条大型的雄性條帶底鱂进行有关雄性精液的检测，可是研究者在该个体中挤出了卵子。可问题是，这只个体拥有明显的雄性特征(拥有清楚的雄性条纹)，但是有产卵雌鱼的外输卵管，背鳍的颜色并不深。这只个体被单独地养在特殊的水箱中，研究显示，这只雄性條帶底鱂的卵子有较低的生育能力。此时，另一只体型相近的雌性條帶底鱂也被放入了水箱。可能是因为所有的卵子都被排出，这条條帶底鱂变得消瘦。此外性格显得专横，并开始显现出更明显的雄性特征。 在7月的最后一个星期里，人们对这条鱼进行了密切观察。在一些场合，它表现出一种明显的男性行为。它绕着雌鱼转，反复做出动作，似乎是在微弱地试图产卵。在这一点上不能肯定，但在其他方面，这是一个求爱的雄性行为。在7月的最后一天，实验者被迫离开实验室，條帶底鱂被杀死，用福尔马林小心地保存起来。对福尔马林中保存的性腺进行检查，发现它是一个复合腺，包含约5%的睾丸组织，稍不成熟，并嵌在一团未成熟和陈旧的卵巢组织中。睾丸组织以微小肿块的形式出现，主要在腺的后端附近。虽然明显的睾丸结构，这些小肿块显示不典型的结构比正常睾丸，不紧密，并点缀结缔组织。整个腺体的颜色、大小和外观与保存完好的睾丸一样，不像产卵结束后的正常卵巢那样呈现黄色的季节。图为该雌雄同体條帶底鱂的描画。 结论1.这个讨论有趣的一点是，因为ta的组织似乎没有显示出性别的二型性，睾丸组织位于卵巢组织的后面，并在某种程度上与后者重叠。性腺的这种状况让人想起前面提到的复合腺。2. 增加了分泌物对第二性征的了解：在这种情况下，相对少量的不完善的睾丸组织的存在对个体(主要是雌性)产生了负面影响，抑制了幼鱼向雌性颜色模式的转变;这种个体在产卵季节结束时，产生的积极影响是，近似于雄性的颜色和行为。3.在现有文献中描述的系列雌雄同体的所有病例中，雌雄同体是在连续的季节发生的。在不到一个月的时间内发生了明显的原雌性变化。这种情况显然是反常的。 **Citation On a Hermaphrodite Example of the Herring(Clupa Harengus). Ann, Mag. Nat.Hist.(7), Vol.9, pp 195-196 Newman, H. H. “A Significant Case of Hermaphroditism in Fish.” Biological Bulletin, vol. 15, no. 5, Marine Biological Laboratory, 1908, pp. 207–14.","link":"/posts/bfdb824e.html"},{"title":"关于我的微信公众号","text":"Translations for the following languages are also provided:English 各位看官大家好啊，我是奇幻海部落格的作者。 在此我想跟大家聊聊我开创这个部落格的初心与对未来的打算。2015年的夏季，奇幻海微信公众号的第一期内容正式发布，标题为从海底探寻生命之源之谜。尽管从现在来看，当时所写的内容可以用拙劣来形容，那第一次的意义依然镌刻在我的心中。从那以后，奇幻海以周更的节奏向前走了4年，从未有过间断，欣喜于哪怕只是一次阅读量破千，困惑于题材以及时间的泥淖。至2019年第229期画上短暂的句号。我目前只是一个普普通通的海洋生物爱好者，当初创立奇幻海是为了督促自己在海中的梦想里孜孜不息，深挖下去。人们都说，最高境界的学习方式是为教导别人，而我尝试以科普的形式，收获知识的同时为更多人引荐碧蓝色下的奥秘。直到我偶得机会出国深造，在面对更多的信息来源时我开始反思，作为一名科普者，如果不能保证所科普信息的真实性，准确性，以及合理性，看到吸引眼球的新闻就照搬不误，坦白了说，就是不负责任。科学文章所讲究的就是科学二字，如果内容上故意夸大，甚至是虚构伪造，那就有违宗旨。我之前所编写的那二百二十九期文章，内容上是否能保证信息的精确，又有如何的渠道来收集信息，筛选，判断，这都是一直苦恼我的问题。有时候，判断文献的准确性需要依靠大量的知识储备，理性的逻辑判断，而这些能力是5年前的我有所欠缺的。正因为我热爱海洋，所以我会对我的行为负责。在这段时间的积攒下，奇幻海以新的面孔与大家见面，希望这个小小的网站，能再发新芽。","link":"/posts/768b897d.html"},{"title":"如何区分章鱼，鱿鱼和乌贼？","text":"测试","link":"/posts/10dd8abd.html"},{"title":"水族馆的水质是如何保持的？如何为你的鱼儿制作一个生态缸？","text":"Translations for the following languages are also provided:English 各位养过鱼的看官是否每隔一段时间就因为水体过于浑浊而被迫换水？而有的水箱以及水族馆却能保持水质并长时间不用换水？–一个完善的水箱系统，小到家里的鱼缸，大到水族馆的大型水箱都是一个个生态的模型，同时也展示了对生命的尊重以及教育的意义。 前言想象一下，一个8000立方米储水量的巨型水箱里饲养着500多种生物，包括鲨鱼，鳐鱼，鳗鱼。。无论这些动物是游动的，底栖的，还是浮游的，他们都会排泄，此外还有喂食时的残渣。这些废料会被细菌分解为亚硝酸盐，此外藻类会暴长。高浓度的亚硝酸盐会在鱼类的鳃上留下疤痕，降低鱼类的免疫力。在这种情况下，动物可能不会表现出生病的表面症状。但它会慢慢死去，或变得更容易受到无法对抗的疾病的影响。 在水族馆，潜水员每天会都要清洗鱼缸玻璃，或者对人造珊瑚进行电动清洗，使用专门的护垫和漂白设备来清除藻类，并在狭窄的缝隙中收集废物。同时，水族馆也有强大的过滤系统：在进入水箱之前，水要经过一个三层过滤系统：包括了蛋白质过滤器，生物过滤器。他们有自己的一套‘生命支持系统’生命支持元素包括过滤、温度、光线和处理系统，这些系统用于保护整个水族馆的水质。这些系统被捆绑在一个中央计算机网络中，能够对不同的展品做出一些调整。大多数情况下，当水质在酸度、盐度或毒性方面失去平衡时，这些系统就会显示出来。生命维持系统的参数确实告诉可以告诉工作人员系统是如何运行的，但它的有效性是由水质来衡量的。所以水族馆经常需要进行水质检测。这些测试测量pH值或氨水平等因素，以便工作人员在必要时对水族馆的生物、化学和机械过滤系统进行调整。 生态缸的概念理论水族馆拥有足够的技术以及设备来维持水质，那么在家里呢？在家里的水箱如何在不换水的情况下也能保持水质？答案就在前文中提过的生物过滤器。大家可以换个角度思考，自然中的河流，湖泊又是怎么能保持水质的？–没错，就是生物过滤系统。而其中的核心就是硝化细菌（微生物代谢）。 特拉华大学海洋学院曾做过用水族馆（水箱）系统模拟海洋中营养物质的再生的实验，论文指出：生物养分再生是海洋生物生产力的主要速率控制过程。（然而，在海洋环境中直接测量再生几乎是不可能的。）限制植物生长的营养物质通过初级生产者，通过食物链，从无机形式循环到有机形式，最后通过细菌分解者循环回到无机形式。 实验表明了生物过滤系统有效地氧化了大量输入的有机物。（溶解有机碳、氮和磷含量没有增加，铵态氮和亚硝酸盐含量没有增加）家里的鱼缸虽小，但也有易操作的优势。制作一个生态缸并没有想象的那么难：现代的观赏鱼缸过滤应是同时具有机械过滤和生物过滤，两种过滤系统是相辅相成的，缺一不可，这也是水族箱局限性决定的。一旦建立完整的生态系统，有害物质可以得到分解，使毒素就大大减少，这样也可以延长水族箱的换水时间。所谓生态鱼缸就是已经建立起完全生物过滤系统，生物过滤系统便是成功在水箱中培养的的硝化细菌，通过水循环将水中的有害物质分解或过滤，在某种程度上说这种微循环系统是仿了自然界的生态系统，只不过把空间局限化了而已，本质是一样的。 操作具体的操作大家可以自行在网上搜索建立生态缸的教程,详细步骤在这里贴上一篇教程，如有侵权请联系删除。 一、开缸前的准备： 设备：水族箱（废话）、外滤桶（其它能容纳玻璃环的过滤器也可以）、打氧泵（包括软管及沙头等）、底砂（可以取消）。 药剂：喜瑞去铵及亚硝酸离子液（简称硝化细菌）。 闯缸鱼：廉价的健康的清洁工作鱼、饲料鱼等。 外滤桶的滤材设置（按水流方向）： 1、粗滤棉（两层），主要作用是进行物理预过滤，如果包在外滤桶的进水口外，则更便于更换； 2、生化棉，主要作用是培养分解有机物的消化细菌，能提高水质澄清度； 3、玻璃环，一般情况下，玻璃环体积要占全缸水体积的3～5%，主要作用是培养硝化细菌，以保证水质无毒性； 4、粗滤棉（一层），主要作用是物理过滤，打散、吸附细菌的代谢废物。 其它种类的过滤设备可参照上述外滤桶进行设置。 二、开缸过程： 第一天，安装设备——注水——铺砂（5cm左右厚度，或不铺砂）——运转设备——检查是否有漏水之处，以及设备安装是否有问题。 第二天，排水再重新注水（经过曝气处理后的自来水即可）——运转设备（过滤及打氧设备，从此不再关闭）————加入状态健康、体质健壮的闯缸鱼，按说明加入硝化细菌。（其后连续十天，按说明继续补充硝化细菌） 第七天左右，据了解一些高手开缸的经验，此时分解NH3/NH4的亚硝酸菌已经初步建立，但硝酸菌还未能跟上步伐，此时水体内NO2的含量会出现峰值，闯缸鱼容易出现不适。如果此时闯缸鱼无任何异常，进食活跃，则可在第十天起逐日继续增加闯缸鱼的数量，并逐渐增加投喂量。 一个月后，生化系统就基本稳定下来了，可以考虑加入贵价主力鱼了。 三、日常维护： 定时换水（每周换三分之一到五分之一），换水周期可逐渐加长，换水量可逐渐减少，以不出现褐藻为限。换入的水如果是自来水，要经过24小时的打气，以去除自来水中的余氯，减少对硝化系统及鱼的伤害。 定量定时喂食，不要让鱼吃得过饱，不要留残饵。 四、注意事项： a、加入闯缸鱼后，如果出现异常，则尽快换水（部分换水）。 b、过滤及打氧设备尽量不要中断运转。 c、过滤桶中的玻璃环总体积要达到全缸水体积的3～5%； d、水体含氧量与生物过滤效率相关，在不影响观赏的前提下，可增加打氧。 e、硝化细菌建议选择进口名牌的，国产杂牌的不如不用。 f、过滤系统的物理过滤及生物过滤，仅能保证水质的清澈及无毒性。对于具体鱼种而言，水温、PH值、硬度都是影响的重要因素。建议参考具体资料，对此进行相应调整。 一点个人的拙见就像我在开头说的，一个完整的水箱系统展示了一整个生态的模型。这一点在水族馆，爬行馆，乃至动物园里都尤为重要，此时教育的意义处在首要位置：展示一种生物，不是单单给你看看生物的样貌就结束了，动物在自然中的行为才是各个博物馆需要为大众普及的，而这些行为：包括栖息，捕食，乃至社交行为等都需要一个至少合格的环境来支持，更不用说一个正确生态环境本来的教育意义了。现在网络如此的普及，个人的玩家只需要动动手指便能了解你想养的动物的生态环境。为您的宠物搭建一个合理的生态环境不仅是一种尊重的态度，也能保证其生存的质量。在搭建一个精美的生态缸后，相信你能体会到更多的成就感。也许一个好的环境能使你的宠物为你带来意想不到的惊喜。 ReferenceSharp, Jonathan H., et al. “Modeling Nutrient Regeneration in the Ocean with an Aquarium System.” Marine Ecology Progress Series, vol. 8, no. 1, Inter-Research Science Center, 1982, pp. 15–23, Retrieved September 20, 2021. Citiation1.Rock, Edward A. “Aquarium Awareness.” Science and Children, vol. 27, no. 7, Temporary Publisher, 1990, pp. 4–6, Retrieved September 20, 2021.2.SCHULTZ, BETH. “THE BALANCED AQUARIUM.” Elementary School Science Bulletin, no. 69, Temporary Publisher, 1962, pp. 5–6, Retrieved September 20, 2021.3.Bell, J. (2015, December 17). Science, elbow Grease keep National AQUARIUM POOP-FREE. The Daily Times. Retrieved September 20, 2021.4.建立生态缸的详细步骤. 建立生态缸的详细步骤_水景堂. (n.d.). Retrieved September 20, 2021, from http://www.ssjjtt.com/a/2015/33267.html.","link":"/posts/e02b0abe.html"},{"title":"生物分类的概念与生物分类法","text":"Translations for the following languages are also provided:English 前段时间介绍了鳄目下三个科成员的特点，以及区分它们的方法。而这其中最基础，也是最重要的参照就是生物分类法了。生物分类法是用生物分类学方法来对生物的物种分组和归类的方法。而大家耳熟能详的域、界、门、纲、目、科、属、种便是以级别为基础的系统层次结构中使用的数量层次。在此，希望给大家介绍一下生物分类的基本概念以及历史。 什么是生物分类学生物分类学是关于生物个体的鉴定（identification）、归类（classification）和命名（nomenclature）的原理和方法的学科；而生物分类学的范围包括: 研究生物类群间的异同程度，阐明生物间的亲缘关系、演化过程和发展规律。 分类的根据说了这么多，可能大家最好奇的就是我们根据什么来将世界上这么多的物种一一分类的。–生物分类主要根据生物的形态结构,生理功能。同时，也可根据栖息环境和地理位置来做参考。举个根据形态结构分类的例子：比如说从解剖学来看，人,猴,羊.狗都有分节的脊椎，因此都归于脊椎动物亚门。相比之下有些动物背部只有一根不分节的骨,比如说文昌鱼类(头索动物亚门)，而这些背后有骨头的物种就都被分为脊索动物门。再举例：海带不再被分类为植物了，因为人们发现海带的叶绿体有四层膜，而植物的叶绿体是两层膜。可以得知海带的“祖先”应该是一种叶绿体是四层膜的生物，和我们所认为的植物是有距离的。 分类数量层次的概念种（物种）是生物分类系统上的基本单位，具有共同基因组成（由此具有共同的祖先，相似的外形、内部结构、行为等），有相对稳定的明显界限与别的物种相区别。近缘的种归合为属，近缘的属归合为科，科隶于目，目隶于纲，纲隶于门，门隶于界。具有相同或相似形态结构的生物亲缘关系近一些，同一物种的生物可以在自然状态下进行交配并且生育出可育的后代。 生物分类的历史以及意义对生物进行分类的意义是便于弄清不同类群之间的亲缘关系和进化关系。最早已知的对生命形式的分类系统由希腊哲学家亚里士多德所建立。他将动物根据运动方式（空中，陆上或水中）分类。在中国，明代李时珍（约1518–1593）在药典《本草纲目》中，将生物药材分为草部、谷部、菜部、果部、木部、虫部、鳞部、介部、禽部、兽部和人部。瑞士教授康拉德·格斯纳（Conrad Gesner, 1516–1565）将当时已知的生物进行了分析性的归纳。新大陆的发现为欧洲带来了很多新奇的动物种类的描述和标本。在16世纪晚期和17世纪早期，人们开始对动物进行了详细描述，先是人们熟悉的种类，随后逐渐扩展，直到形成了基于解剖学基础的足够大的知识体系。这些解剖学知识主要来源于医学解剖学家，随后昆虫学家和最初的显微镜学者将分类的范围进一步扩大。 现代生物分类学之父卡尔·林奈的巨著《自然系统》在其一生中被改编过12次。在此书中，自然界被划分为三个界：矿物、植物和动物。林奈用了四个分类等级：纲、目、属和种。林奈还建立了用于命名所有物种的学名的方法，并沿用至今。在林奈之前，命名一个物种需要很长的包括许多单词的名称，其中包括了对物种的描述，并且这些名称不固定。林奈将物种名称统一成两个单词的拉丁文名称，即学名，由此分开了命名法和分类法。这种生物命名的方法称作双名法。而后的生物学家才根据其用域(Domain)、界(Kingdom)、门(Phylum)、纲(Class)、目(Order)、科(Family)、属(Genus)、种(Species)加以分类。 以上就是本文的全部内容了，最后附上生物分类级别与生物分类总表的链接 Reference1.中国大百科智慧藏：分类学2. Linnaeus, Carolus. Systema naturae per regna tria naturae :secundum classes, ordines, genera, species, cum characteribus, differentiis, synonymis, locis 10th. Stockholm: Laurentius Salvius. 17583. Linnaeus, C. Systemae Naturae, sive regna tria naturae, systematics proposita per classes, ordines, genera &amp; species. 1735.4. Wikipedia,Taxonomy (biology),8,22,20215. Zhihu,2021,8,22","link":"/posts/da406dc9.html"},{"title":"虎鲸语言的文化","text":"Translations for the following languages are also provided:English 首先先提一句，鲸类的交流能力是被认为在齿鲸与须鲸分化之前进化出来的。而虎鲸已经是其中声音文化研究得相对较充分的了。研究者能根据虎鲸的声音判断出其情感色彩和目的：保持个体之间的联系，同步运动，解决攻击性和性冲突。所以，这些叫声可以用在各种不同的行为环境中，这也是虎鲸的典型叫声。 虎鲸在所有海洋中都有分布，但是被分为很多种群和生态群。 不同的种群展现出食性, 行为,形态, 和基因遗传上的巨大差异。当然，其语言上也就出现了不同的方言 PS: 研究表明各个种群语言的演化和其位置(与另一个虎鲸种群的距离)完全没有关系: 所以不存在向人类那样相距很近的两个地区方言也很相似的情况。 一般认为虎鲸可能在幼年时就学会了它们的交流技能，并优先从它们经常进行社交互动的动物那里获得叫声。野生幼鲸在第一年的大部分时间里都是在靠近母亲的地方度过的，后来逐渐开始更多地与自己的母系和相关母系的鲸鱼互动。 目前关于虎鲸声学通信的知识主要来自于北太平洋和东北大西洋的种群，而对其他种群的发声结构和使用的了解相对较少。在这篇文章中，我们将回顾虎鲸声学交流的不同方面，以提供对导致刻板呼叫变化的过程的见解，这导致了群体和种群曲目的极端多样性。 ###虎鲸的语言 虎鲸声音的功能虎鲸能产生各种各样的声音信号，可以分为三类:咔嚓声、呼叫声和口哨声。和其他齿鲸一样，虎鲸通过发出滴答声来进行回声定位，这使它们能够根据回声的声学特性(如时间和频率)来导航和定位水下物体。因此，回声定位的咔哒声并不是主要的交流信号，尽管个体仍然可以从其他个体的回声定位咔哒声模式中提取有价值的信息(比如觅食信息)。叫声和哨声的功能还不太清楚，但人们认为它们的主要功能是维持群体凝聚力和协调社会关系。大多数叫声是刻板的，但它们的结构非常多样化，从简单的低频吱吱声到复杂的多音节高音叫声。模式化调用的集合形成了不同的曲目，允许不同的成员识别和跟踪每一个远距离的成员。 例子: 尽管虎鲸的叫声非常多样化，但它们可以被分成大的类别，这些类别似乎具有与它们的结构相关的特定功能。例如，在北太平洋地区的虎鲸中，具有两个重叠的独立调制成分的叫声(双声叫声，下图)通常比单声叫声产生更高的声压强度。高频分量比低频分量更有方向性，这可能允许接收器识别的方向和呼叫者的移动方向的比例强度的上低频分量。这些发现表明，双音呼叫的一个近似功能是远程协调运动。 相比之下，在群体间的近距离接触的社会环境中，单声呼叫更常被听到。在一次成功的海洋哺乳动物捕杀后，北太平洋的瞬态动物只在其社会群体中交流时使用单声呼叫，但当两个遥远的群体在会面过程中交流时，它们会发出双声呼叫。 一些叫声似乎在特定的行为环境中使用得更频繁。例如，在当地虎鲸中的社交过程中，变化和异常的叫声比刻板的叫声使用得更多。 研究者(Rehr,2011)发现了一种特定类别的可变呼叫，其特征是快速的上下频率调制，并称为“兴奋”呼叫。这种叫声在北太平洋所有三个生态型的虎鲸中有被发现。这些叫声似乎主要在高刺激状态下使用。这种调制模式的叫声是虎鲸在暴露于海军声纳时发出的。据推测，它们可能在攻击行为中发挥作用，因为这是源自冰岛的圈养虎鲸攻击行为中呼叫结构的最显著变化之一：迄今为止报道的唯一一种特定环境的叫声是冰岛和设得兰群岛的虎鲸发出的所谓的“群聚叫声”，这种叫声似乎专门用于在捕食过程中操纵鲱鱼进入密集的鱼群。在不同种群和生态类型的个体和群体中，声音的使用因活动类型而异，似乎主要与社会环境和被追逐的猎物类型有关。东北太平洋居民(以鱼类为主食)虎鲸在任何活动状态下都经常发出声音（除了休息）。相比之下，东北太平洋瞬态(以哺乳动物为食)虎鲸大多只在捕杀后或社交时才会发出叫声和哨声，而在其他活动状态下则大多保持沉默。","link":"/posts/4fddae3f.html"},{"title":"生物解剖学,带你解剖小白鼠","text":"Translations for the following languages are also provided:English 前言解剖学(Anatomy)的历史最早可以追溯到古希腊时期。 这是生物学的一门分支学科，涉及生命体的结构与组织的研究。于此同时，解剖学和胚胎学，进化生物学以及系统发育有密切关系。而随着科技的发展，解剖学从单单的肉眼观察，发展并完善到了依靠各种工具和科技的配合(如显微镜,x射线,核磁共振成像等技术)。至此，解剖学可以分为微观尺度及巨观尺度。解剖学囊括了人类解剖学，动物解剖学，以及植物解剖学。本文中，将会着重于动物解剖学的介绍。 定义解剖学是对生物体结构的科学研究，包括它们的系统、器官和组织。它包括各个部件的外观和位置，组成它们的材料，它们的位置以及它们与其他部件的关系。解剖学与生理学和生物化学截然不同，后者分别处理这些部分的功能和所涉及的化学过程。例如，解剖学家关心一个器官(如肝脏)的形状、大小、位置、结构、血液供应和神经支配;生理学家对胆汁的产生、肝脏在营养中的作用和身体功能的调节感兴趣。 *在了解动物解剖学之前大部分动物的身体可以分为不同的组织，这些动物称为真后生动物。这些动物的体内有消化腔、有一个或二个开口(口，肛门)动物组织一般可以分为结缔组织、上皮组织、肌肉及神经组织。 **结缔组织:**结缔组织是纤维性的，由分散在称为细胞外基质的无机物中的细胞组成。结缔组织使器官成形并固定在适当的位置。主要类型有疏松结缔组织、脂肪组织、纤维结缔组织、软骨和骨。其中最主要的成分是胶原蛋白。 图为显微镜下的透明软骨 **上皮组织:**上皮组织由紧密包裹的细胞组成，细胞间几乎没有空隙。上皮细胞可呈鳞状、立方状或柱状，紧邻结缔组织；有许多不同类型的上皮细胞，经过修饰以适应特定的功能。比如在呼吸道中有一种纤毛上皮组织;小肠内壁有微绒毛，大肠内有肠绒毛。皮肤由覆盖在脊椎动物身体外部的角质化的分层鳞状上皮组织组成。 **肌肉:**肌肉细胞通过收缩组织掌管身体的活动。肌肉组织的功能是产生力量并引起运动，无论是广义上的运动还是内部器官的运动。肌肉由可收缩的细丝组成，分为三种主要类型;平滑肌、骨骼肌和心肌。 **神经组织:**神经组织是由许多被称为神经元的神经细胞组成的，它们相互传递信息。在简单的动物中(如腔肠动物)，体壁的受体神经元对刺激产生局部反应。在更复杂的动物中，它们拥有专门的感受器细胞，如化学感受器和光感受器，会成群结队地出现，并沿着神经网络向生物体的其他部分发送信息。神经节内的神经元可以连接在一起.在高等动物中，专门的受体是感觉器官的基础，有中枢神经系统(大脑和脊髓)和外周神经系统。 细分在动物解剖学，我们首先将有无脊椎作为为一个大的分类。还记得上一篇的分类学吗？无脊椎动物由大量的生物组成，从最简单的单细胞真核生物，如草履虫，到复杂的多细胞动物，如章鱼、龙虾和蜻蜓。它们构成了大约95%的动物物种。根据定义，这些生物都没有脊椎。再细分，如节肢动物解剖学，软体动物解剖等. 而所有的脊椎动物都有相似的基本身体结构，在它们生命中的某个时刻，主要是在胚胎阶段，有共同的主要脊索动物特征;一根坚硬的脊索;神经物质的背中空管，即神经管;咽弓;还有一条尾巴在肛门后面。脊椎动物的四肢被认为是同源的，因为相同的骨骼结构是从它们最后的共同祖先继承来的。顺便一提，在往下细分，又可以分成：对鱼类的解剖，两栖纲的解剖，爬行纲的解剖，鸟(纲)的解剖，哺乳(纲)的解剖，以及人体解剖学。（注：这里将人体解剖学区分于哺乳纲解剖之外）如此细分下来，我们就能够根据各个类别动物的特点，根据生理结构以及各其大系统的分布来进行更精确且有效率的解剖了。同时，根据解剖的结果，我们也能从中得知各类动物的差异。 解剖大鼠（注：下文内容含尸体，内脏，等图片，可能引起不适。请各位观众酌情观看，15岁以下的读者请就此止步。）最后，我将为大家介绍一场对大鼠的解剖实验，从下文的介绍中，希望大家能对解剖学的目的有些许自己的认知。原文大意：对大鼠进行解剖，探讨基本哺乳动物的内部结构和功能解剖学。本实验的目的是探索大鼠的消化道并进行观察消化系统的不同部分。通过观察大鼠消化系统的长度，可以确定他们的饮食模式的信息，并进行在老鼠和其他哺乳动物之间进行比较，如杂食动物、食肉动物和食草动物。因为老鼠是一种胎盘哺乳动物和杂食动物，它的身体结构和人类非常相似。 首先是解剖大鼠的安全警示：1.处理标本: 如果使用经过保存的大鼠(非活体)，重要的是要注意保存大鼠的防腐溶液和建议的预防措施。 将保存的大鼠从保存的溶液中取出后，立即用流动的水冲洗。 在通风良好的地方进行实验。 建议戴隐形眼镜的人不要解剖的在防腐溶液中的老鼠。蒸发的溶液可以穿透隐形眼镜刺激眼睛。建议佩戴实体眼镜 考虑处理安乐死或最近解冻或保存的老鼠时的过敏和化学敏感等问题 如果老鼠的胃/肠子被意外切开，要注意从刚刚被安乐死或解冻的老鼠身上可能释放出的微生物气溶胶和难闻的气味。 如果使用冷冻老鼠，请提前在冰箱中解冻一夜，并在24小时内使用。 在任何时候都应遵守良好的卫生习惯:手在实验时远离嘴，鼻，眼以及脸，并在处理解剖材料后立即洗手。 2.解剖刀的使用守则: 手术刀刀片的大小，手柄必须兼容，例如4号手柄和23号刀片。 保持刀片在箔包装和附加到手柄与锋利的刀片指向远离身体。 应小心地使用钳子、镊子或商用刀片拆卸器拆卸刀片。 替代解剖刀的方法是使用一次性手术刀。 3.实验器材 PPE -实验服/围裙(建议使用一次性塑料围裙)、安全眼镜和手套。 手术刀 剪刀 钳 探针 解剖针/针 报纸包裹的解剖板。釉面瓷砖、尼龙塑料板、乙烯基解剖垫或一次性泡沫托盘。 线 纸巾 消毒剂-医院级，通用消毒剂，包装必须注明“医院级”，是一种通用的硬质表面消毒剂会杀死微生物。 70% v/v乙醇(/images/sucai/anatomy/tools.jpg) 实验步骤 首先识别出大鼠头部、胸部和腹部所有可见的外部结构。见Figure 1a. 观察大鼠的口腔和牙齿。 将老鼠背部着地放在解剖托盘上。绳子是用来固定老鼠背部的四肢的。将绳子牢牢地系在一只手腕上，将绳子从托盘下穿过并牢牢地系好另一只手腕。后肢重复这个动作。见Figure 1b. 用镊子夹起腹部中间的皮肤。用钝头向下的剪刀切开皮肤和下面的肌肉。切向肋骨的底部，然后向另一个方向切向生殖器开口。从肋骨底部切下来，然后切到两条后腿。 从下面的肌肉上剥下皮瓣，注意它们之间的结缔组织。用解剖针将老鼠皮肤钉到解剖板上。见Figure \\2. 用钳子提起腹壁，打开腹腔，用剪刀切开，操作步骤与上述步骤4相同。小心不要因为切口太深而损伤腹部的任何器官。 剥去腹壁，用针钉出腹部器官。检查消化器官的原位，并确定所有的结构。注意分散的奶油色脂肪沉积。注意肝脏的大小与腹部的比例。见Figure 3. 切除消化系统的方法是将食道从与胃连接处的上方切开，并切除直肠。注意小肠和大肠相互缠绕的方式。见Figure 4 用手指轻轻撕裂肠系膜，小心地将十二指肠和结肠从结缔组织中拉开，小心地将消化道伸出。测量消化道的长度和大鼠的身体，比较这些数字的比例。见Figure 5. 注意肝和盲肠的大小与大鼠的身体的关系。 小心地取出肝，比较脾和肝的颜色。注意:大鼠无胆囊。 观察暴露的肾脏及相关泌尿器官，以及腹腔内遗留的生殖系统。 见Figure 6. 如果时间允许进行进一步的研究，用钝头剪刀在中腹部切开，向前穿过横膈膜肌肉和胸骨，直到大鼠的下巴。 横膈膜，将胸腔和腹腔分开，可以从胸腔中切掉。 切掉肋骨，露出被一层叫做心包的薄膜包围的心脏，这是位于心脏上部的白色胸腺还有位于心脏两侧的肺。见Figure 7. 摘除心脏和胸腺，以定位气管(气管)的软骨环。食道就在气管的下面。 清理 确保所有仪器都已归还。 老鼠的所有部位和一次性泡沫盘(如使用)必须用报纸包好，并与手套、一次性围裙(如使用)一起放入专用塑料垃圾袋中。当所有废物收集完毕后，用双层袋子处理。如果无法立即处理，应冻结材料。 如果解剖板、剪刀、镊子、探针、解剖针和手术刀上有血液，应立即浸泡在消毒剂中。否则，用热肥皂水清洗设备并漂洗或将设备放入洗碗机中以减少处理。 清洗后的解剖器械可在70% v/v乙醇中浸泡20分钟，作为额外的消毒剂，避免生锈。 彻底干燥所有设备 彻底消毒工作场所及洗手。 以上就是本期奇幻海的全部内容了，希望大家喜欢。&lt;3Reference Gillian Morriss-Kay(2016), The Journal of Anatomy: origin and evolution 5,92021. ASTA,Science ASSIST,Feb 2016 Mason, Stephen F. (1962). A History of the Sciences. New York: Collier. p. 550 Henry Gray.Anatomy of the Human Body.1918 Rotimi, Booktionary. “Anatomy”. Archived from the original on 1 August 2017.","link":"/posts/c83a0197.html"},{"title":"Saturation Diver with Diving Bell and Thanatos","text":"本文同时提供以下语言的翻译:中文 IntroductionSaturation Diver is a little-known high-risk occupation.More than 100 meters underwater, in the pure black water, the operation continues with only a few supply pipes and a faint overhead light.Surrounded by darkness and the unknown,Feel a sudden rush of water and see nothing.With psychological stress, unstable conditions and equipment that can go wrong by negligence, a single misstep can kill these divers in deep water. What is saturation diving?In water, for every additional 10 meters of depth, the water exerts an additional atmospheric pressure on the object.For example, a balloon filled with air will be smaller 10 meters underwater than it is at sea level,As the depth increases, the balloon becomes smaller ( and denser).On the contrary, when the balloon rises, the pressure decreases, and the balloon grows in size, returning to its original size when it leaves the water. It is important to note that in scuba diving, the diver is always breathing.This causes the inert gas to dissolve more in the blood, and if it rises rapidly, the volume of bubbles in the blood increases, causing irreversible damage to the body.That’s why it’s mandatory for scuba divers to make a safety stop when diving more than 30 meters. In 1957, George Bond at the Naval Submarine Medical Research Laboratory demonstrated that humans could actually withstand prolonged exposure to high pressure through saturation diving.Specifically through the chamber pressure, so that the dissolved inert gas in the body fluids in the body tissue of divers to achieve saturation.All dives can stay underwater for dozens of days, after which the decompression time depends on depth, residence time, and breathing gas, but usually takes about half a month. MeaningSaturation diving allows divers to stay underwater for long periods of time, which saves money and makes divers more efficient.Divers can be on standby in the diving bell’s living quarters in case of emergency.Generally, saturated diving is mainly needed in the fields of submarine cable, oilfield pipeline underwater installation, rescue operations. Diving Bell systemSaturation diving uses a closed bell platform that enters the water through a hatch at the bottom.But the hatch is sealed as it rises to maintain internal pressure.At the surface, it locks into hyperbaric oxygen chambers, where divers saturate or decompress.The bell is connected to the cabin through the bottom or side hatch, and a conduit in the middle is pressurized, allowing the diver to move to the cabin under pressure.In saturated diving, the bell is the vehicle to and from work, and the cabin system is the living area.The top of a diving bell is connected to a tube and a steel cable. The tube is used to provide helium-oxygen mixture, heating, and electricity.Steel cables enable the ship to pull the diving bell up from the sea floor.If the dive is relatively short (jump diving), decompression can be done in the bell chamber in exactly the same way as in the chamber. Potential Danger* sequelae *Despite saturation diving, long-term deep-sea operations can still be harmful.The British Journal of Industrial Medicine documented that 40 commercial saturated divers with an average age of 34.9 years (24-49 years) were examined one to seven years after their last deep dive (190-500 m water).Four of them lost their diving licenses because of neurological problems.Divers reported significantly more neurological symptoms.Difficulty concentrating and paresthesia in the hands and feet are common.On neurological examination, they had more neurological abnormalities, consistent with dysfunction of the lumbar spinal cord or spinal root.They also had a greater percentage of abnormal electroencephalograms than the control group.Neurological symptoms and findings were highly associated with deep diving (including deep) exposure, but more significantly associated with air and saturated diving and prevalence of decompression sickness.Visual evoked potential, brainstem auditory evoked potential and magnetic resonance imaging showed no obvious abnormalities.Four divers (10%) experienced brain dysfunction during or after diving;Two had seizures, one had temporary cerebral ischemia, and one had temporary systemic amnesia.As a result, deep-sea diving may have long-term effects on the divers’ nervous system. AccidentsAfter-effects aside, the smallest detail that goes wrong during a dive can kill the crew: not just the divers, yes, but the crew on board.5 November 1983 Beford Dolphin accident, North Sea Oil field;The four divers returned from the operation, left the diving bell and entered the living room of the compression chamber to decompress.Despite all the experience of the crew, Crammond, who performed the extravehicular separation, made a fatal mistake (presumably) :After disarming the diving bell without confirming that the door was fully sealed, Crammond was shot to death by the pressure difference between the decompression chamber and the outside,His assistant was seriously wounded.The four divers in the decompression chamber were even more miserable: nine atmospheres of pressure suddenly dropped to one atmosphere, pulling air out of their lungs and causing them to collapse.The gas in the blood burst, causing the tissue to block the blood vessels, and he died instantly.Wildrake diving accident, 8 August 1979, North Sea Oil Fields;Because of the rupture of the cable, and the misjudgment of the commander, all the cables connecting the diving bell broke.Due to the harsh conditions, it took 19 hours for the bell to be brought to shore. The two divers inside,Richard Walker and Victor, died of multiple organ failure caused by extreme lack of oxygen and cold.It took eight years for the oil company to admit its wrongdoing. Several saturation diving accidents so far have been the result of human errors of judgment, and in the Case of the Biford dolphin, the Norwegian government did not mandate the use of a relatively sophisticated insurance lockout system.It is worth pondering that people attach importance to money and despise life.But as technology matures, hopefully there will be no more accidents like this. Citation Todnem, K., et al. “Neurological Long Term Consequences of Deep Diving.” British Journal of Industrial Medicine, vol. 48, no. 4, BMJ, 1991, pp. 258–66. “Byford Dolphin (09092)”. DNV GL Vessel Register. Det Norske Veritas. Retrieved 14 July 2010. Smart, Michael (2011). Into the Lion’s Mouth: The Story of the Wildrake Diving Accident. Medford, Oregon: Lion’s Mouth Publishing. ISBN 978-0-615-52838-0. LCCN 2011915008.","link":"/posts/f168bf92.html"},{"title":"如何区分鳄目下各科成员？","text":"Translations for the following languages are also provided:English 对大多数人来说，鼍科和鳄科的成员长得很像，他们也的确有许多相同的特性，但如果你能留心一些细节，你就会发现他们的不同。 “鳄目（学名：Crocodilia）通称为鳄鱼，属于脊索动物门蜥形纲。分布于热带到亚热带的河川、湖泊、海岸中，现存24种。”–摘自百科 作为最远可以追溯到三叠纪晚期（楔形鳄科），并鼎盛于侏罗纪与白垩纪的鳄鱼家族，他们以强有力的身体以及两栖（两栖爬行类）的特性在各地位于生态链的顶端。根据研究，鳄鱼在那段时期有大约150个属，而如今只有8个属26种。不过需要区分的是，如今我们所说的鳄鱼拉丁学名是Eusuchia（真鳄亚目，现今鳄目的唯一亚目），译为‘真正的鳄类’。出现于白垩纪晚期，与‘原始’的鳄鱼有显著区别：从上颌骨、上颚和翼骨中形成了一个完整的次级上颚，此外还有一些其它的头颅特征。地球历史进入新生代中新世后，气候逐步开始变的干燥，往日遍布世界的热带雨林逐步变成了草原。这一切对陆地动物的影响非常大，许多新的适应干燥气候的哺乳动物例如猫科、熊科等新食肉类却迅速崛起，占据了食物链的上端。对气候变化的不适应和竞争对手的强大导致了到中新世末期，全球几乎所有大型陆栖鳄鱼和相当多的两栖生活的鳄鱼都已难觅踪迹。（如跑鳄科，平顶鳄科等。） 分类言归正传，如今的鳄目成员被分为了3大科：真鳄科（Crocodylidae）、鼍科【短吻鳄科】（Alligatoridae）、以及食鱼鳄科【长吻鳄科】（Gavialidae）为了给大家一个直观的认知，我会在文章结尾放上现代分类的全览。 鼍科成员与鳄科成员的区别对大多数人来说，鼍科和鳄科的成员长得很像，他们也的确有许多相同的特性，但如果你能留心一些细节，你就会发现他们的不同。先说说真鳄科的成员，Crocodile，一个大家小学时就耳熟能详的单词，指的就是真鳄科的成员（Alligator指的是鼍科）。它们主要分布在非洲、亚洲、美洲和澳大利亚的热带地区，喜欢在淡水中如河、湖和沼泽地中聚集。有时也会生活在半海水中（湾鳄）。PS:根据地理位置与种群分布来进行判断也是一个很好的选择。通常情况下，鳄鱼（鳄科）比短吻鳄（鼍科）更具攻击性，这使得鳄鱼比短吻鳄更危险。短吻鳄是机会主义的捕食者，这意味着除非被激怒，它们一般不会去追你。（pps:还是最好在绝对安全的前提下进行观察(￣、￣)） 嘴形和下颌轮廓可能是区分鳄鱼和短吻鳄最简单的方法，不过有些种的鳄鱼会存在例外，因此可能具有迷惑性。 嘴型：短吻鳄的嘴宽而圆，呈u型，而鳄鱼的嘴又长又尖，呈v型。 颚线:短吻鳄的上颚很宽，这样牙齿就可以藏在嘴里。鳄鱼和短吻鳄在这个意义上是不同的，它们的上下颌骨大小几近相同。图中从上至下依次为：美洲鳄，黑凯门鳄（鼍科），美洲鼍另一种分辨他们的方法是观察他们的牙齿，鳄科成员一个绝对且显著的特征是：下颌第4或第6齿外漏，较长且垂直生长，以至于它们的上颌处有特地的豁口在闭嘴时切合住牙齿。鼍科下鼍亚科与凯门鳄亚科中，鼍亚科成员在上下颚闭合时下齿不外露，而凯门鳄亚科部分成员因为成年后“暴力生长”的原因···部分成员下颚牙齿会在闭嘴时露出。【1】但就算是暴力生长，鼍科成员的上颚并没有凹陷来避开牙齿，因此在野外有时能目击到鼍的下颚牙齿刺穿上颚皮肤继续生长的例子。(牙齿过度生长的凯门鳄) 颈部盾片也是区别鼍科与鳄鱼的一大标准。鼍科所有成员的颈部盾片从脑后连续不断的延伸至背部。而真鳄科成员脑后没有盾片，颈盾与背部盾片断开且不连续。根据鳄鱼的颈部盾片甚至可以更为具体到判断鳄鱼的种类，在这里就不详细展开说了。 总结对比图上方为鼍科代表密河鼍（短吻鳄），下方为真鳄科代表湾鳄。侧视图可以看到密河鼍没有外露的下齿，而湾鳄不仅下齿外露，且有超长的下颚第四齿露出。俯视图可以明显观察到密河鼍U形的吻部和湾鳄V形的吻部，以及湾鳄上颌明显的凹陷处。同时我们也能看到密河鼍颈部盾片从脑后一直连续下去，而湾鳄则有裸露断开的部分。【2】 最后的食鱼鳄科是这三大科中最容易区分的，他们吻部极长，上下齿规律交错。由于和真鳄科关系接近，因而他们的颈盾与背部盾片也是不连续的。 最后放一 张三 个科成员的照片供大家比对 现代分类鼍科（短吻鳄科） Alligatoridae 鼍亚科 Alligatorinae 鼍属 Alligator 鼍（扬子鳄 Alligator sinensis 密河鳄 Alligator mississippiensis 凯门鳄亚科 Caimaninae 凯门鳄属 Caiman 眼镜凯门鳄 Caiman crocodilus 巴拉圭凯门鳄 Caiman yacare 宽吻凯门鳄 Caiman latirostros 古鳄属 Paleosuchus 钝吻古鳄 Paleosuchus palpebrosus 锥吻古鳄 Paleosuchus trigonatus 黑鳄属 Melanosuchus 黑凯门鳄 Melanosuchus niger 真鳄科 Crocodylidae 鳄亚科 Crocodylinae 鳄属 Crocodylus 美洲鳄 Crocodylus acutus 非洲狭吻鳄 Crocodylus cataphractus 奥利诺科鳄 Crocodylus intermedius 澳洲淡水鳄 Crocodylus johnstoni 菲律宾鳄 Crocodylus mindorensis 危地马拉鳄（莫瑞雷鳄） Crocodylus moreletii 尼罗鳄 Crocodylus niloticus 新几内亚鳄 Crocodylus novaeguineae 沼泽鳄 Crocodylus palustris 湾鳄 Crocodylus porosus 古巴鳄 Crocodylus rhombifer 暹罗鳄 Crocodylus siamensis 西非尼罗鳄Crocodylus suchus 侏鳄属 Osteolaemus 侏鳄 Osteolaemus tetraspis 狭吻鳄属 Mecistops 非洲狭吻鳄 Mecistops cataphractus 细嘴狭吻鳄 Mecistops leptorhynchus 食鱼鳄科(长吻鳄科) Gavialidae 切喙鳄属 Tomistoma 马来长吻鳄 Tomistoma schlegelii 长吻鳄属 Gavialis 恒河鳄 Gavialis gangeticus CitationEverglands,The Difference Between Alligators and Crocodiles,https://www.evergladesholidaypark.com/alligators-and-crocodiles/#:~:text=Physical%20Differences&amp;text=Snout%20Shape%3A%20Alligators%20have%20a,%2Dshelled%20vertebrates%2C%20like%20turtles. July,12,2021Schwimmer, David R. The Size of Deinosuchus. King of the Crocodylians: The Paleobiology of Deinosuchus. Indiana University Press. July,11,2021James P. Ross. Heinz Fritz Wermuth, Evolution and classification, Britannica,https://www.britannica.com/animal/crocodile-order/Evolution-and-classification, July,11,2021Paxingtianxia,(Crocodile face blindness treatment paste) take you to distinguish 24kinds of crocodiles in the world (upper · true crocodile family), freewechat, https://freewechat.com/a/MzI1Nzc3OTE1OA==/2247514655/1, July,12,2021注【1】【2】摘自爬行天下，【鳄鱼脸盲症治疗贴】带你分清全世界24种鳄鱼（上 · 真鳄科）","link":"/posts/fef3ca0d.html"},{"title":"鳗鱼的一生","text":"Translations for the following languages are also provided:English 鳗鱼的一生：相信凭借各位多年网上冲浪的经验，肯定对鳗鱼幼体(柳叶鳗阶段)那全身透明的特征多少有点印象： 如果各位好奇鳗鱼是如何从透明的幼体发育到成体的话，还请往下看。 大部分鳗鱼属于降海性鱼类(比如日本鳗)：从哪里出生，就去哪里产下下一代。也就是说鳗鱼一生的迁徙路线是这样的:在海水中孵化，发育并进入河流，性成熟后重回海水中交配产卵，最终重回宁静。PS:这一特点使得同一地区鳗鱼的基因十分相似。 总体来说我们一般将鳗鱼的生长发育分为5个阶段：柳叶鳗(Leptocephali) &gt;玻璃鳗(Glass eels)&gt; 鳗线(Elver) &gt;黄鳗(Yellow eels)&gt; 银鳗(Silver eels) 柳叶鳗刚刚从卵孵化而成的柳叶鳗，体态透明，体长仅有数毫米。根据其体态特征，学者们推测它们以有机碎屑为食。柳叶鳗随着生长体高逐渐增加，形似柳叶，故得名柳叶鳗。这样的体型能很好的帮助柳叶鳗随着海流，或者河流移动。此外，柳叶鳗的体表有大量的粘多糖(Glycosaminoglycan)，增加身体的含水量，以便提供浮力。 玻璃鳗当柳叶鳗随着水流移动到沿岸水域后，就开始了像蝌蚪那样的变态 发育。在数星期内，柳叶鳗体表的粘多糖分解，提供骨骼，肌肉内脏发育所需要的能量。这时身体从柳叶型变成圆柱的流线型，即玻璃鳗。这时它们的运动方式也从被动的浮游变成主动性的游动。同时食性也因此改变。 鳗线与色素沉淀在玻璃鳗阶段，他们的脊椎骨很快发育完成。此时皮下色素开始发育形成保护色，随着鳗鱼颜色的不断加深，到达一定阶段后我们将它们归类为鳗线（两者界限尚不明确） 黄鳗黄鳗可以被认为是尚未性成熟的成体鳗鱼，这一阶段他们的体色会随着当地的环境有所差别，如有黑色，棕绿色，青蓝色等。黄鳗也是鳗鱼成长最快的阶段，一年可以增长十厘米左右。 银鳗鳗鱼的性别是后天决定的：当幼鳗成长至15-30厘米时，它们的生殖腺才开始发育。而控制鳗鱼性别的外在因素尚且不明，这可能与种群密度，成长速率，水体盐度等有关。银鳗是鳗鱼发育的最后阶段，鳗鱼在降海洄游前，眼睛变大，背部和胸鳍变黑，腹部变成银灰色以便适应深海环境。最后放一张所有阶段的图","link":"/posts/4a74782b.html"},{"title":"Blackwater Photography:experience the mystery of lives","text":"本文同时提供以下语言的翻译: Chinese For the uninitiated, heading out into the open ocean in the dark of night may not be a wise idea.Diving in the open ocean without limits will send chills down the spine of many people.It’s as if you’re deprived of sight, and all you’re surrounded by is darkness, the sound of breathing, and the helplessness of the cold water biting into your skin.But once you master the skills, the possibilities for exploring the open ocean are endless – Blackwater photography. Black water diving has reached a fever pitch among underwater photographers around the world.At first, only a few dared venture out into the open ocean at night, but now it’s fast becoming the next big thing in underwater photography.##What is Blackwater Photography?Blackwater photography is not your average nighttime dive.The subjects had to be in absolute darkness: diving lines and lights were used to attract plankton and the larval stages (or parts of adults) of various Marine organisms in very deep waters where the seafloor was not visible.Including jellyfish, sea squirts, comb jellies, and pteropods.And shrimp, octopus, squid…And countless other species.Since there is a significant increase in the number of plankton and numerous species active in the upper waters at night, this is a great opportunity to photograph these amazing creatures.Blackwater photography brings us clear portraits of these creatures. In addition to the investigation of the photographer’s technology and mentality, blackwater photography also has very high requirements for the environment: as mentioned above, blackwater photography has very high requirements for the background: pure black is the best, if the weather and other factors caused by the turbidity of the sea will make the photographer this trip to prepare for nothing.But the high return of the high risk is the most exciting part of this sport, and when you get a good sample, the joy is self-evident. Larva of an eel Chascanopsetta prorigera| for animals was clear and reflective, exposed in the post-processing reflective eyes and back to clear the details of the part. Lamprogrammus| ‘I call this kind of thing “x factor”.Because we all want to see the few animals on the list, but a truly special encounter is unimaginable until it happens.Kona’s Black water is not for target diving or photographing animals.It’s about the diversity of the ocean.Copyright ©2020 Jeff Milisen. All Rights Reserved Megalocranchia|you never know what can you see when blackwater diving. Jellyfish hunting for food Prawn | blackwater image is so attractive, in large part due to focusing on the theme of the unusual.Shrimp is very common, but focusing on tiny details can make a classic.• Photo ©2020 Jeff Milisen. All Rights reserved ‘this is the only time I encountered this kind of alvine bipeds.Its colorful feet first caught my attention, and when I followed it, it opened itself up enough to let me know what I was looking at.Some subjects are so small that it’s hard to know what they are at first.Take the time to look at your subject, be as sharp as you can, and try to use a higher aperture.In the editing part of the workflow, it’s common to cut down 50-60%, so don’t worry too much about this unless you’re printing a big-character poster.’–Anilao, Janao Bay, Philippines Dolphins and other megafauna are not common in the black water.Because they are large, they move fast, and in low light, filming them with a macro lens while diving in black water is a real challenge.","link":"/posts/48d85428.html"},{"title":"黑水摄影：感受生命的艺术","text":"Translations for the following languages are also provided:English 对于外行来说，在漆黑的夜里前往开阔的海洋可能不是一个明智的想法。在无边无际的公海里潜水，着实会让许多人脊背发凉。就像被剥夺了视觉一样，你的周遭只有黑暗，呼吸的声响和冰冷的海水刺入皮肤的无助。可一但你掌握了技能，探索开放海洋的可能性是无限的–黑水摄影。 黑水潜水在全世界的水下摄影师中已经达到了狂热的程度。一开始，只有少数人敢在夜间冒险进入开阔的海洋，但现在，它征迅速成为着水下摄影的下一件大事。##什么是黑水摄影？黑水摄影可不是普通的在夜间潜水时拍摄这么简单。 拍摄的对象必须处在绝对的黑暗中：在非常深的且看不见海底的海域中，使用下潜线和灯光来吸引浮游生物以及各类海洋生物幼体阶段的生命(或部分成体)。包括有各种水母，海鞘，栉水母，翼族类。还有虾，章鱼，乌贼。。。等各种数不胜数的物种。由于在夜晚时，浮游生物以及大量物种活跃在上层水域的数量会有显著的增加， 这是一个拍摄这些神奇生物的绝佳机会。而黑水摄影则为我们带来了这些生物的一张张清晰的肖像。 黑水摄影除了对摄影师技术和心态的考察外，还对环境的要求极高：前文说过，黑水摄影对背景的要求极高：纯黑为最佳，如若天气等因素造成的海水浑浊将使摄影师这一趟的准备化为乌有。但高风险所带来的高收益正是这一运动所最刺激的地方，当拿到精彩的样片是，那种喜悦是不言而喻的。 鳗鱼的幼体 夏威夷长颌鲆| 对于既清晰又反光的动物，在后期处理中暴露反光眼睛并带回清晰部分的细节。 某种软鼬鳚|‘我把这类事情称为“x因素”。因为我们都想看到名单上的少数动物，但真正特别的遭遇是无法想象的，直到它发生。科纳的黑水不是为了目标潜水或拍摄动物。它是关于海洋的多样性。’•照片版权所有©2020 Jeff Milisen 某巨大小头鱿科|你永远不知道在黑水潜水时你会看到什么。 正在捕食的水母 对虾|黑水图像之所以如此吸引人，很大程度上是因为对不同寻常的主题的聚焦。虾是非常常见的，但专注于微小的细节可以成就经典。•照片版权所有©2020 Jeff Milisen 前鳃纲的幼体|‘这是我唯一一次遇到这种小腹足动物。它彩色的脚首先引起了我的注意，当我跟着它走的时候，它打开了自己，足以让我明白我在看什么。有些实验对象很小，一开始很难知道它们是什么。花点时间观察拍摄对象，拍的时候要尽可能锐利，并尝试使用更高的光圈。在工作流程的编辑部分，裁剪50-60%是很常见的，所以不要太担心这个问题，除非你要打印一个大字报。’–Anilao, Janao Bay, Philippines 海豚和其他巨型动物在黑水上是不常见的。因为它们体型庞大，移动迅速，而且在光线较暗的情况下，用微距镜头在黑水潜水时拍摄它们是一个真正的挑战。","link":"/posts/71247350.html"}],"tags":[{"name":"Photography","slug":"Photography","link":"/tags/Photography/"},{"name":"Art","slug":"Art","link":"/tags/Art/"},{"name":"Knowlege","slug":"Knowlege","link":"/tags/Knowlege/"},{"name":"greet","slug":"greet","link":"/tags/greet/"},{"name":"knowledge","slug":"knowledge","link":"/tags/knowledge/"},{"name":"Diving","slug":"Diving","link":"/tags/Diving/"},{"name":"淡水","slug":"淡水","link":"/tags/%E6%B7%A1%E6%B0%B4/"}],"categories":[]}