{"pages":[{"title":"","text":"google-site-verification: googleecc1ef655c3a68ee.html","link":"/googleecc1ef655c3a68ee.html"},{"title":"","text":"个人简介 分享很喜欢的老罗的一段话： “每一个生命来到世间都注定改变世界，别无选择。要么变得好一点，要么变得坏一点。你如果走进社会为了生存为了什么不要脸的理由，变成了一个恶心的成年人社会中的一员，那你就把这个世界变得恶心了一点点。如果你一生刚正不阿，如果你一生耿直，没有做任何恶心的事情，没做对别人有害的事情，一辈子拼了老命勉强把自己身边的几个人照顾好了，没有成名没有发财，没有成就伟大的事业，然后耿着脖子一生正直，到了七八十岁耿着脖子去世了。你这一生是不是没有改变世界？你还是改变世界了，你把这个世界变得美好了一点点。因为世界上又多了一个好人。“ 善恶终有报,天道好轮回。不信抬头看,苍天饶过谁。无论何时何地，我们都要保持一颗积极乐观、善良感恩的心。但行好事莫问前程，永远年轻，永远热内盈眶，永远保持正能量。💪💪💪💪💪💪冲鸭！！！！ -&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;个人信息：海洋生物爱好者 博客信息 网站采用的Icarus主题 追求尽可能的简洁，清晰，易用。 在Icarus主题之上进行了部分修改。 更新日志：–2020.09.20：icarus4.0适配–2020.01.18：icarus3.0适配–2019.11.17：增加深色主题开关–2019.10.30：去图，精简卡片–2019.10.22：改版部分显示，优化速度–2019.10.16：文章列表加上评论数显示–2019.10.13：改版评论–2019.09.25：图片、资源接入CDN免费jsDelivr、文章加入置顶–2019.09.19：开源博客代码–2019.09.19：修改布局，拉伸布局，更宽的展示–2019.09.18：修改友链ui为一行三个，并适配移动端，暗黑模式文章增加评论链接，增加留言链接–2019.09.14：增加精简next主题–2019.09.14：利用中秋节放假，重做了首页的热门推荐、加个widget最新评论框、归档页加入文章贡献概览面板 本站推荐索引 博客主题相关 github Issue 作为博客微型数据库的应用 github page网站cdn优化加速 博客源码分享 博客换肤的一种实现方式思路 博客中gitalk最新评论的获取 博客图片上传picgo工具github图传使用 安装、部分配置icarus主题中文版 技术知识点 Java并发知识点 法律法规 法律法规数据库 中华人民共和国国旗法 中华人民共和国宪法 中华人民共和国消费者权益保护法 中华人民共和国刑事诉讼法 中华人民共和国婚姻法 中华人名共和国网络安全法 中华人民共和国劳动法 其他 网易云音乐歌单分享 计划2020计划 2019.12.31 2020-GOALS 跑两三场马拉松 2019计划 2018.12.31/21:59:00-&gt;更新于2019.12.31 2019-GOALS 购买的专业书籍至少看完一遍（并发、重构、设计模式…）-&gt; 95% 额外： 追了很多剧 总结： 有优点有缺点，没坚持下来的还是太多，追了太多剧。以后多学习，多思考！ 时间轴记录","link":"/about/index.html"},{"title":"","text":"🎈🎈微笑墙🎈🎈 彭小苒 唐艺昕 李一桐 gakki 图片搜集于互联网，侵权请留言，马上处理😊。","link":"/album/index.html"},{"title":"","text":"&nbsp;&nbsp;听听音乐 音乐播放器由mePlayer提供，布局参照网友博客所作，感谢作者的辛勤付出。更多音乐分享请查看歌单。 &nbsp;&nbsp;看看视频 ->点击以下条目开始播放视频,向下滑动查看更多","link":"/media/index.html"},{"title":"","text":"来而不往非礼也畅所欲言，有留必应","link":"/message/index.html"},{"title":"","text":"申请友链须知 原则上只和技术类博客交换，但不包括含有和色情、暴力、政治敏感的网站。 不和剽窃、侵权、无诚信的网站交换，优先和具有原创作品的网站交换。 申请请提供：站点名称、站点链接、站点描述、logo或头像（不要设置防盗链）。 排名不分先后，刷新后重排，更新信息后请留言告知。 会定期清理很久很久不更新的、不符合要求的友链，不再另行通知。 本站不存储友链图片，如果友链图片换了无法更新。图片裂了的会替换成默认图，需要更换的请留言告知。 本站友链信息如下，申请友链前请先添加本站信息： 网站图标：https://removeif.github.io/images/avatar.jpg 网站名称 奇幻海 网站地址：https://removeif.github.io 网站简介：后端开发，技术分享 加载中，稍等几秒...","link":"/friend/index.html"},{"title":"","text":"碎碎念 tips：github登录后按时间正序查看、可点赞加❤️、本插件地址..「+99次查看」 碎碎念加载中，请稍等... $.getScript(\"/js/gitalk_self.min.js\", function () { var gitalk = new Gitalk({ clientID: '46a9f3481b46ea0129d8', clientSecret: '79c7c9cb847e141757d7864453bcbf89f0655b24', id: '666666', repo: 'issue_database', owner: 'removeif', admin: \"removeif\", createIssueManually: true, distractionFreeMode: false }); gitalk.render('comment-container1'); });","link":"/self-talking/index.html"},{"title":"音乐歌单收藏","text":"温馨提示：选择喜欢的音乐双击播放，由于版权原因部分不能播放。如果喜欢歌单收藏一下，去网易云都能播放哟！","link":"/music/index.html"}],"posts":[{"title":"Art Works for Marine","text":"住在海边，可惜一直没有机会一探海中的风情，只能依靠想象简单画出了两幅图Live in the seaside, regrettably did not have the opportunity to explore the amorous feelings in the sea all the time,can only rely on imagination to draw two pictures simply.软件：Krita","link":"/posts/82df373d.html"},{"title":"2021年水下摄影大赛获奖作品","text":"自2015年起，为传承始于英国的布莱顿水下电影节，Alex Mustard, Dan Bolt ， Peter Rowlands与他们的网站Underwaterphotographer创办了年度水下摄影大赛（UPY），恢复了几十年前英国举办的大型国际水下比赛的传统。此次摄影大赛共设有 13 个类别，包括微距、广角、行为、沉船以及海洋保护等，其中有四个类别专门针对英国水域。比赛汇集了来自全球 68 个国家和地区摄影师的 4500 多张作品。下面让我们共同欣赏来自世界各地摄影师所呈现的艺术吧。 ## **2021年度水下摄影奖&广角组冠军（Wide Angle）** Winner:’Sharks’Skylight’ Renee Capozzola(USA) ## **广角组** 亚军(runner up): ‘Gothic Chamber’ Martin Broen(USA) 季军(thrid):’Jellyfish galore’ Oleg Gaponyuk(Russain) Highly Commended 'RED DOT' ![](/images/sucai/UPY2021/4.jpg) > Tobias Friedrich(Germany) 'Upside down' ![](/images/sucai/UPY2021/5.jpg) > Alvaro Herrero(Spain) 微距组（Marco）冠军：‘Pontohi pigmy seahorse’(彭氏豆丁海马) Galice Hoarau(Norway) 亚军:’Larval Lionfish’(幼体狮子鱼/蓑鲉) Steven Kovacs(USA) 季军:’Dream ship’ Chien-ting hou(Taiwan) Highly Commended 'Xenia piperhorse'(Xenia类海龙) ![](/images/sucai/UPY2021/9.jpg) > Dr Alex Tattersall(UK) ps:【海龙英文为pipefish,有一种学说认为Pipehorse是海龙（pipefish）与海马（seahore）之间的进化纽带】 'Rainbow Angel'(彩虹天使(海鞘)) ![](/images/sucai/UPY2021/10.jpg) > Viktor Lyagushkin(Russian Federation) 'The Fastest Nudy'(海蛞蝓) ![](/images/sucai/UPY2021/11.jpg) > Fabio Iardino(Italy) 沉船组（Wrecks）冠军:’BOWLANDER’ Tobias Friedrich(Germany) 亚军:’Reclaimed by the Ocean’ Grant Thomas (UK) 季军:’Golden Hour at the Georgios’ Renee Capozzola (USA) Highly Commended 'VERTIGO(晕头转向)' ![](/images/sucai/UPY2021/15.jpg) > Tobias Friedrich (Germany) 'Lift off' ![](/images/sucai/UPY2021/16.jpg) > Grant Thomas (UK) 行为组（Behaviour）冠军:’A striped marlin in a high speed hunt in Mexico’ Karim Iliya (USA) 亚军:’Face to face’ JingGong Zhang (China) 季军: ‘Milk feeding’ Mike Korostelev (Russian Federation) Highly Commended 'The Last Waltz' ![](/images/sucai/UPY2021/20.jpg) > Ralph Pace (USA) 'Orcas predating a thresher shark' ![](/images/sucai/UPY2021/21.jpg) > Rafael Fernandez Caballero (捷克共和国) 'Embrace' ![](/images/sucai/UPY2021/22.jpg) > João Rodrigues (Portugal) 'The next generation' ![](/images/sucai/UPY2021/generation.jpg) > Tammy Gibbs (Australia) 肖像组（Portrait）冠军:’Guardian Deity’ Ryohei Ito (Japan) 亚军:’Japanese manefish(日本鲷鱼)’ Keigo Kawamura (Japan) 季军:’French Angel’ Michael Gallagher (UK) Highly Commended 'Eye contact with humpback whale' ![](/images/sucai/UPY2021/26.jpg) > Mike Korostelev (Russian Federation) 'Critically endangered cuban crocodile in a cenote' ![](/images/sucai/UPY2021/27.jpg) > Anita Kainrath (Austria) 'Snooty the lemon shark' ![](/images/sucai/UPY2021/28.jpg) > Galice Hoarau (Norway) 卡片机组（Compact）冠军:’Doule (Kuhlia Rupestris) near the surface’ Jack BERTHOMIER (New Caledonia) 亚军:’Rainbow Goby’ ManBd (Malaysia) 季军: ‘Pelagic stingray (Pteroplatytrygon violacea)’ Isaías Cruz (Spain) Highly Commended 'Toad tadpole on water lily leaf' ![](/images/sucai/UPY2021/32.jpg) > Andrea Falcomatà (Italy) 'Life drop' ![](/images/sucai/UPY2021/33.jpg) > Chiara Scrigner (Italy) 'The Orchid' ![](/images/sucai/UPY2021/34.jpg) > ManBd (Malaysia) 英国水域广角组(British Waters Wide Angle)冠军:’While You Sleep’ Mark Kirkland (UK) 亚军:’The Great Migration’ Mark Kirkland (UK) 季军:’Grey seal gully’ Kirsty Andrews (UK) Highly Commended 'The gannet and the mackerel ![](/images/sucai/UPY2021/38.jpg) > Richard Shucksmith (UK) 本文内容精选于UPY 官网，如果感兴趣的话，朋友们可以点进去欣赏更多作品。","link":"/posts/9b6854e5.html"},{"title":"关于我的微信公众号","text":"各位看官大家好啊，我是奇幻海部落格的作者。 在此我想跟大家聊聊我开创这个部落格的初心与对未来的打算。2015年的夏季，奇幻海微信公众号的第一期内容正式发布，标题为从海底探寻生命之源之谜。尽管从现在来看，当时所写的内容可以用拙劣来形容，那第一次的意义依然镌刻在我的心中。从那以后，奇幻海以周更的节奏向前走了4年，从未有过间断，欣喜于哪怕只是一次阅读量破千，困惑于题材以及时间的泥淖。至2019年第229期画上短暂的句号。我目前只是一个普普通通的海洋生物爱好者，当初创立奇幻海是为了督促自己在海中的梦想里孜孜不息，深挖下去。人们都说，最高境界的学习方式是为教导别人，而我尝试以科普的形式，收获知识的同时为更多人引荐碧蓝色下的奥秘。直到我偶得机会出国深造，在面对更多的信息来源时我开始反思，作为一名科普者，如果不能保证所科普信息的真实性，准确性，以及合理性，看到吸引眼球的新闻就照搬不误，坦白了说，就是不负责任。科学文章所讲究的就是科学二字，如果内容上故意夸大，甚至是虚构伪造，那就有违宗旨。我之前所编写的那二百二十九期文章，内容上是否能保证信息的精确，又有如何的渠道来收集信息，筛选，判断，这都是一直苦恼我的问题。有时候，判断文献的准确性需要依靠大量的知识储备，理性的逻辑判断，而这些能力是5年前的我有所欠缺的。正因为我热爱海洋，所以我会对我的行为负责。在这段时间的积攒下，奇幻海以新的面孔与大家见面，希望这个小小的网站，能再发新芽。","link":"/posts/768b897d.html"},{"title":"Welcome To Fantacy Sea","text":"这是一个关于海洋知识的博客，我会为大家展示奇妙的海中世界。欢迎大家关注&gt;_&lt;","link":"/posts/c77b8e29.html"},{"title":"如何区分章鱼，鱿鱼和乌贼？","text":"测试","link":"/posts/10dd8abd.html"},{"title":"如何区分鳄目下各科成员？","text":"“鳄目（学名：Crocodilia）通称为鳄鱼，属于脊索动物门蜥形纲。分布于热带到亚热带的河川、湖泊、海岸中，现存24种。”–摘自百科 作为最远可以追溯到三叠纪晚期（楔形鳄科），并鼎盛于侏罗纪与白垩纪的鳄鱼家族，他们以强有力的身体以及两栖（两栖爬行类）的特性在各地位于生态链的顶端。根据研究，鳄鱼在那段时期有大约150个属，而如今只有8个属26种。不过需要区分的是，如今我们所说的鳄鱼拉丁学名是Eusuchia（真鳄亚目，现今鳄目的唯一亚目），译为‘真正的鳄类’。出现于白垩纪晚期，与‘原始’的鳄鱼有显著区别：从上颌骨、上颚和翼骨中形成了一个完整的次级上颚，此外还有一些其它的头颅特征。地球历史进入新生代中新世后，气候逐步开始变的干燥，往日遍布世界的热带雨林逐步变成了草原。这一切对陆地动物的影响非常大，许多新的适应干燥气候的哺乳动物例如猫科、熊科等新食肉类却迅速崛起，占据了食物链的上端。对气候变化的不适应和竞争对手的强大导致了到中新世末期，全球几乎所有大型陆栖鳄鱼和相当多的两栖生活的鳄鱼都已难觅踪迹。（如跑鳄科，平顶鳄科等。） 分类言归正传，如今的鳄目成员被分为了3大科：真鳄科（Crocodylidae）、鼍科【短吻鳄科】（Alligatoridae）、以及食鱼鳄科【长吻鳄科】（Gavialidae）为了给大家一个直观的认知，我会在文章结尾放上现代分类的全览。 鼍科成员与鳄科成员的区别对大多数人来说，鼍科和鳄科的成员长得很像，他们也的确有许多相同的特性，但如果你能留心一些细节，你就会发现他们的不同。先说说真鳄科的成员，Crocodile，一个大家小学时就耳熟能详的单词，指的就是真鳄科的成员（Alligator指的是鼍科）。它们主要分布在非洲、亚洲、美洲和澳大利亚的热带地区，喜欢在淡水中如河、湖和沼泽地中聚集。有时也会生活在半海水中（湾鳄）。PS:根据地理位置与种群分布来进行判断也是一个很好的选择。通常情况下，鳄鱼（鳄科）比短吻鳄（鼍科）更具攻击性，这使得鳄鱼比短吻鳄更危险。短吻鳄是机会主义的捕食者，这意味着除非被激怒，它们一般不会去追你。（pps:还是最好在绝对安全的前提下进行观察(￣、￣)） 嘴形和下颌轮廓可能是区分鳄鱼和短吻鳄最简单的方法，不过有些种的鳄鱼会存在例外，因此可能具有迷惑性。 嘴型：短吻鳄的嘴宽而圆，呈u型，而鳄鱼的嘴又长又尖，呈v型。 颚线:短吻鳄的上颚很宽，这样牙齿就可以藏在嘴里。鳄鱼和短吻鳄在这个意义上是不同的，它们的上下颌骨大小几近相同。图中从上至下依次为：美洲鳄，黑凯门鳄（鼍科），美洲鼍另一种分辨他们的方法是观察他们的牙齿，鳄科成员一个绝对且显著的特征是：下颌第4或第6齿外漏，较长且垂直生长，以至于它们的上颌处有特地的豁口在闭嘴时切合住牙齿。鼍科下鼍亚科与凯门鳄亚科中，鼍亚科成员在上下颚闭合时下齿不外露，而凯门鳄亚科部分成员因为成年后“暴力生长”的原因···部分成员下颚牙齿会在闭嘴时露出。【1】但就算是暴力生长，鼍科成员的上颚并没有凹陷来避开牙齿，因此在野外有时能目击到鼍的下颚牙齿刺穿上颚皮肤继续生长的例子。(牙齿过度生长的凯门鳄) 颈部盾片也是区别鼍科与鳄鱼的一大标准。鼍科所有成员的颈部盾片从脑后连续不断的延伸至背部。而真鳄科成员脑后没有盾片，颈盾与背部盾片断开且不连续。根据鳄鱼的颈部盾片甚至可以更为具体到判断鳄鱼的种类，在这里就不详细展开说了。 总结对比图上方为鼍科代表密河鼍（短吻鳄），下方为真鳄科代表湾鳄。侧视图可以看到密河鼍没有外露的下齿，而湾鳄不仅下齿外露，且有超长的下颚第四齿露出。俯视图可以明显观察到密河鼍U形的吻部和湾鳄V形的吻部，以及湾鳄上颌明显的凹陷处。同时我们也能看到密河鼍颈部盾片从脑后一直连续下去，而湾鳄则有裸露断开的部分。【2】 最后的食鱼鳄科是这三大科中最容易区分的，他们吻部极长，上下齿规律交错。由于和真鳄科关系接近，因而他们的颈盾与背部盾片也是不连续的。 最后放一 张三 个科成员的照片供大家比对 现代分类鼍科（短吻鳄科） Alligatoridae 鼍亚科 Alligatorinae 鼍属 Alligator 鼍（扬子鳄 Alligator sinensis 密河鳄 Alligator mississippiensis 凯门鳄亚科 Caimaninae 凯门鳄属 Caiman 眼镜凯门鳄 Caiman crocodilus 巴拉圭凯门鳄 Caiman yacare 宽吻凯门鳄 Caiman latirostros 古鳄属 Paleosuchus 钝吻古鳄 Paleosuchus palpebrosus 锥吻古鳄 Paleosuchus trigonatus 黑鳄属 Melanosuchus 黑凯门鳄 Melanosuchus niger 真鳄科 Crocodylidae 鳄亚科 Crocodylinae 鳄属 Crocodylus 美洲鳄 Crocodylus acutus 非洲狭吻鳄 Crocodylus cataphractus 奥利诺科鳄 Crocodylus intermedius 澳洲淡水鳄 Crocodylus johnstoni 菲律宾鳄 Crocodylus mindorensis 危地马拉鳄（莫瑞雷鳄） Crocodylus moreletii 尼罗鳄 Crocodylus niloticus 新几内亚鳄 Crocodylus novaeguineae 沼泽鳄 Crocodylus palustris 湾鳄 Crocodylus porosus 古巴鳄 Crocodylus rhombifer 暹罗鳄 Crocodylus siamensis 西非尼罗鳄Crocodylus suchus 侏鳄属 Osteolaemus 侏鳄 Osteolaemus tetraspis 狭吻鳄属 Mecistops 非洲狭吻鳄 Mecistops cataphractus 细嘴狭吻鳄 Mecistops leptorhynchus 食鱼鳄科(长吻鳄科) Gavialidae 切喙鳄属 Tomistoma 马来长吻鳄 Tomistoma schlegelii 长吻鳄属 Gavialis 恒河鳄 Gavialis gangeticus CitationEverglands,The Difference Between Alligators and Crocodiles,https://www.evergladesholidaypark.com/alligators-and-crocodiles/#:~:text=Physical%20Differences&amp;text=Snout%20Shape%3A%20Alligators%20have%20a,%2Dshelled%20vertebrates%2C%20like%20turtles. July,12,2021Schwimmer, David R. The Size of Deinosuchus. King of the Crocodylians: The Paleobiology of Deinosuchus. Indiana University Press. July,11,2021James P. Ross. Heinz Fritz Wermuth, Evolution and classification, Britannica,https://www.britannica.com/animal/crocodile-order/Evolution-and-classification, July,11,2021Paxingtianxia,(Crocodile face blindness treatment paste) take you to distinguish 24kinds of crocodiles in the world (upper · true crocodile family), freewechat, https://freewechat.com/a/MzI1Nzc3OTE1OA==/2247514655/1, July,12,2021注【1】【2】摘自爬行天下，【鳄鱼脸盲症治疗贴】带你分清全世界24种鳄鱼（上 · 真鳄科）","link":"/posts/fef3ca0d.html"}],"tags":[{"name":"Art","slug":"Art","link":"/tags/Art/"},{"name":"Photography","slug":"Photography","link":"/tags/Photography/"},{"name":"greet","slug":"greet","link":"/tags/greet/"},{"name":"淡水","slug":"淡水","link":"/tags/%E6%B7%A1%E6%B0%B4/"}],"categories":[]}